package org.podval.calendar.schedule.tanach

/*
Days without Tachanun
Рош ходеш
Йом тов
Хол- амоэд
Канун Рош ашана
Рош ашана
Канун Йом кипур
Йом кипур
Месяц тишрей с 11 числа
Ханука
Ту бишват
Пурим катан и Шушан Пурим катан
Пурим и Шушан Пурим (Пурим мешулаш также 16 адара)
Весь месяц нисан
Песах шени
Лаг баомер
С 1 до 12 сивана
Тиша беав
Ту биав
Все дни кроме Песах шени, кануна Рош ашана и кануна Йом кипура их канун в минху не говорят таханун.
В Песах шени и шабат не читают таханун (в биркат амазон и шма аль амита) в ночь на их исходе

Хасидские даты
10 кислева
19-20 кислева
5 тевета - не все
10 швата - не все
3 тамуза - не все
12-13 тамуза
18 элула - не все
Минха в канун этих дней

Note: when Av Harachamim is not said on Shabbos (by the way, when Tisha Bav is on Shabbos, it *is* said,
although we wouldn't have said Tachanun if it wasn't Shabbos...) - but shouldn't postponed fast
(or advanced Purim) leave some trace?

Добавить Пурим мешулаш:
Шушан Пурим, выпадающий на шабат, празднуется три дня. В пятницу читают мегилу, в шабат Тору, а в йом ришон - сеуда и остальные заповеди.

*/
object Tachanun {

}
