<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
   
      <title>What do we want? (The Dream)</title>
      <link rel="stylesheet" type="text/css" href="css/docbook.css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.78.1">
      <link rel="home" href="index.html" title="Digital Judaica Done Right">
      <link rel="up" href="index.html" title="Digital Judaica Done Right">
      <link rel="prev" href="ar01s01.html" title="Introduction">
      <link rel="next" href="ar01s03.html" title="Implementation">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">What do we want? (The Dream)</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="ar01s01.html">Prev</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="ar01s03.html">Next</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="section">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="d0e46"></a>What do we want? (The Dream)
                  </h2>
               </div>
            </div>
         </div>
         <div class="section">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="d0e49"></a>&#1040;&#1085;&#1085;&#1086;&#1090;&#1072;&#1094;&#1080;&#1103;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#1055;&#1086;&#1088;&#1072; &#1089;&#1092;&#1086;&#1088;&#1084;&#1091;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1085;&#1072;&#1082;&#1086;&#1085;&#1077;&#1094;, &#1074; &#1087;&#1080;&#1089;&#1100;&#1084;&#1077;&#1085;&#1085;&#1086;&#1084; &#1074;&#1080;&#1076;&#1077; &#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1099;, &#1080; &#1085;&#1072;&#1095;&#1072;&#1090;&#1100;
                               &#1095;&#1090;&#1086;-&#1090;&#1086; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100;.
            </p>
         </div>
         <div class="section">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="d0e54"></a>&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#1052;&#1099; &#1093;&#1086;&#1090;&#1080;&#1084; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090;&#1099; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; (&#1056;&#1072;&#1079;&#1076;&#1077;&#1083; 2), &#1074;&#1084;&#1077;&#1097;&#1072;&#1102;&#1097;&#1077;&#1084; &#1074;&#1089;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;, &#1085;&#1091;&#1078;&#1085;&#1091;&#1102; &#1076;&#1083;&#1103;
               &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; (&#1056;&#1072;&#1079;&#1076;&#1077;&#1083; 3) &#1089; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;&#1084;&#1080;. &#1048;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; (&#1056;&#1072;&#1079;&#1076;&#1077;&#1083; 5) &#1076;&#1086;&#1083;&#1078;&#1077;&#1085;
               &#1079;&#1072;&#1074;&#1086;&#1088;&#1072;&#1078;&#1080;&#1074;&#1072;&#1090;&#1100; &#1089;&#1074;&#1086;&#1077;&#1081; &#1084;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1080;&#1089;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;, &#1080; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1077; - &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100;
                              &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1072; &#1074;&#1086;&#1082;&#1088;&#1091;&#1075; &#1082;&#1086;&#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; (&#1056;&#1072;&#1079;&#1076;&#1077;&#1083; 6), &#1074; &#1076;&#1091;&#1093;&#1077; &#1089;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074;&#1077;&#1103;&#1085;&#1080;&#1081;. &#1042; &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080;,
                               &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1085;&#1072;&#1088;&#1086;&#1076; &#1082; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1082;&#1072;&#1082; &#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1072;&#1085;&#1100;&#1096;&#1077; ("build it and they
                               will come").
            </p>
         </div>
         <div class="section">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="d0e59"></a>&#1063;&#1090;&#1086; &#1085;&#1072;&#1076;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;
                     </h3>
                  </div>
               </div>
            </div>
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d0e62"></a>&#1058;&#1077;&#1082;&#1089;&#1090;
                        </h4>
                     </div>
                  </div>
               </div>
               <p>&#1053;&#1072;&#1076;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090;&#1099; &#1085;&#1072; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1103;&#1079;&#1099;&#1082;&#1072;&#1093;, &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1087;&#1080;&#1096;&#1091;&#1090;&#1089;&#1103; &#1089;&#1087;&#1088;&#1072;&#1074;&#1072;
                                      &#1085;&#1072;&#1083;&#1077;&#1074;&#1086;. &#1042; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;&#1093; &#1085;&#1072; &#1080;&#1074;&#1088;&#1080;&#1090;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1075;&#1083;&#1072;&#1089;&#1086;&#1074;&#1082;&#1080;, &#1072; &#1090;&#1086; &#1080; &#1082;&#1072;&#1085;&#1090;&#1080;&#1083;&#1103;&#1094;&#1080;&#1103;.
               </p>
               <p>&#1041;&#1099;&#1074;&#1072;&#1102;&#1090; &#1090;&#1072;&#1082;&#1078;&#1077; "&#1086;&#1089;&#1086;&#1073;&#1099;&#1077;" &#1073;&#1091;&#1082;&#1074;&#1099; (&#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1077;&#1085;&#1085;&#1099;&#1077;, &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1077;&#1085;&#1085;&#1099;&#1077;, &#1087;&#1077;&#1088;&#1077;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1099;&#1077;), &#1080; &#1085;&#1072;&#1076;&#1086;
                                      &#1080;&#1093; &#1086;&#1090;&#1084;&#1077;&#1090;&#1080;&#1090;&#1100;.
               </p>
               <p>&#1053;&#1072;&#1076;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1092;&#1086;&#1090;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1080; &#1088;&#1091;&#1082;&#1086;&#1087;&#1080;&#1089;&#1077;&#1081; &#1080;&#1083;&#1080; &#1087;&#1088;&#1086;&#1089;&#1082;&#1072;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1082;&#1085;&#1080;&#1075;.
                                      &#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1080; &#1072;&#1091;&#1076;&#1080;&#1086;- &#1080; &#1074;&#1080;&#1076;&#1077;&#1086;- &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1099;.
               </p>
            </div>
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d0e71"></a>&#1040;&#1085;&#1085;&#1086;&#1090;&#1072;&#1094;&#1080;&#1080;
                        </h4>
                     </div>
                  </div>
               </div>
               <p>&#1053;&#1072;&#1076;&#1086; &#1091;&#1084;&#1077;&#1090;&#1100; &#1086;&#1090;&#1084;&#1077;&#1095;&#1072;&#1090;&#1100; textual features, &#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1074;&#1099;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100; &#1080; &#1074;&#1099;&#1103;&#1074;&#1083;&#1103;&#1090;&#1100; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;,
                                      &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1091;&#1102;&#1089;&#1103; &#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077;:
               </p>
               <div class="itemizedlist">
                  <ul class="itemizedlist" style="list-style-type: disc; ">
                     <li class="listitem">
                        <p>&#1048;&#1084;&#1077;&#1085;&#1072; &#1083;&#1102;&#1076;&#1077;&#1081;</p>
                     </li>
                     <li class="listitem">
                        <p>&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103; &#1084;&#1077;&#1089;&#1090;</p>
                     </li>
                     <li class="listitem">
                        <p>&#1053;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1083;&#1086;&#1074;&#1072; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1077;&#1074;</p>
                     </li>
                     <li class="listitem">
                        <p>&#1040;&#1074;&#1090;&#1086;&#1088;&#1086;&#1074; &#1074;&#1099;&#1089;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081;</p>
                     </li>
                     <li class="listitem">
                        <p>&#1052;&#1077;&#1090;&#1086;&#1076; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1074; &#1074;&#1099;&#1089;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1058;&#1072;&#1083;&#1084;&#1091;&#1076;&#1072;</p>
                     </li>
                     <li class="listitem">
                        <p>&#1060;&#1088;&#1072;&#1079;&#1099;, &#1087;&#1086;&#1076; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1072; &#1101;&#1090;&#1086;&#1090; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090; &#1074;&#1093;&#1086;&#1076;&#1103;&#1090; &#1074; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;</p>
                     </li>
                  </ul>
               </div>
               <p>&#1053;&#1072;&#1076;&#1086; &#1090;&#1072;&#1082;&#1078;&#1077; &#1091;&#1084;&#1077;&#1090;&#1100; &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1090;&#1072;&#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1089; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;:</p>
               <div class="itemizedlist">
                  <ul class="itemizedlist" style="list-style-type: disc; ">
                     <li class="listitem">
                        <p>&#1053;&#1072; &#1082;&#1072;&#1082;&#1086;&#1081; &#1089;&#1090;&#1072;&#1076;&#1080;&#1080; &#1074;&#1099;&#1095;&#1080;&#1090;&#1082;&#1080; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;</p>
                     </li>
                     <li class="listitem">
                        <p>"&#1058;&#1072;&#1075;&#1080;"</p>
                     </li>
                  </ul>
               </div>
            </div>
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d0e104"></a>&#1048;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072;
                        </h4>
                     </div>
                  </div>
               </div>
               <p>&#1053;&#1072;&#1076;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1095;&#1077;&#1089;&#1082;&#1091;&#1102; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1091; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1091;&#1102;, &#1074; &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1076;&#1083;&#1103;
                                      &#1089;&#1089;&#1099;&#1083;&#1086;&#1082;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;: &#1058;&#1077;&#1082;&#1089;&#1090; &#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1058;&#1072;&#1085;&#1072;&#1093; &#1082;&#1085;&#1080;&#1075;&#1072;, &#1075;&#1083;&#1072;&#1074;&#1072;, &#1089;&#1090;&#1080;&#1093; &#1061;&#1091;&#1084;&#1072;&#1096; &#1085;&#1077;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;
                                      &#1061;&#1091;&#1084;&#1072;&#1096; &#1087;&#1072;&#1088;&#1096;&#1072; (&#1090;&#1080;&#1087; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; - &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1072;&#1103; &#1080;&#1083;&#1080; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1072;&#1103; - &#1090;&#1086;&#1078;&#1077; &#1085;&#1072;&#1076;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;) &#1056;&#1072;&#1096;&#1080; &#1085;&#1072;
                                      &#1058;&#1072;&#1085;&#1072;&#1093; &#1082;&#1085;&#1080;&#1075;&#1072;, &#1075;&#1083;&#1072;&#1074;&#1072;, &#1089;&#1090;&#1080;&#1093;, &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1081; &#1052;&#1080;&#1096;&#1085;&#1072; &#1090;&#1088;&#1072;&#1082;&#1090;&#1072;&#1090;, &#1075;&#1083;&#1072;&#1074;&#1072;, &#1084;&#1080;&#1096;&#1085;&#1072; &#1058;&#1072;&#1083;&#1084;&#1091;&#1076;
                                      &#1090;&#1088;&#1072;&#1082;&#1090;&#1072;&#1090;, &#1083;&#1080;&#1089;&#1090;/&#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1072; &#1058;&#1072;&#1083;&#1084;&#1091;&#1076; &#1090;&#1088;&#1072;&#1082;&#1090;&#1072;&#1090;, &#1075;&#1083;&#1072;&#1074;&#1072;, &#1074;&#1099;&#1089;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077; &#1056;&#1072;&#1084;&#1073;&#1072;&#1084; [&#1082;&#1085;&#1080;&#1075;&#1072;,] &#1079;&#1072;&#1082;&#1086;&#1085;&#1099;
                                      &#1086;, &#1079;&#1072;&#1082;&#1086;&#1085; [, &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;] &#1064;&#1091;&#1083;&#1093;&#1072;&#1085; &#1040;&#1088;&#1091;&#1093; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;, &#1089;&#1080;&#1084;&#1072;&#1085;, &#1089;&#1077;&#1080;&#1092;[, &#1089;&#1077;&#1080;&#1092; &#1082;&#1086;&#1090;&#1086;&#1085;]
               </p>
               <p>&#1053;&#1072;&#1076;&#1086; &#1091;&#1084;&#1077;&#1090;&#1100; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1058;&#1072;&#1083;&#1084;&#1091;&#1076;&#1072;, &#1087;&#1088;&#1080;&#1095;&#1077;&#1084; &#1080;&#1085;&#1086;&#1075;&#1076;&#1072; - &#1076;&#1083;&#1103;
                                      &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1080;&#1079;&#1076;&#1072;&#1085;&#1080;&#1081; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080; &#1090;&#1086;&#1075;&#1086; &#1078;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;. &#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1089;&#1090;&#1088;&#1086;&#1082;
                                      &#1090;&#1086;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1080;&#1075;&#1086;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103;.
               </p>
               <p>&#1059; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088; (&#1075;&#1083;&#1072;&#1074;&#1072;/&#1089;&#1090;&#1080;&#1093; &#1080;
                                      &#1087;&#1072;&#1088;&#1096;&#1072; &#1074; &#1061;&#1091;&#1084;&#1072;&#1096;&#1077;; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1080; &#1074;&#1099;&#1089;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074; &#1058;&#1072;&#1083;&#1084;&#1091;&#1076;&#1077;). &#1056;&#1072;&#1079;&#1085;&#1099;&#1077; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100;
                                      "&#1085;&#1077;&#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1080;&#1084;&#1099;&#1084;&#1080;": &#1087;&#1072;&#1088;&#1096;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1082;&#1086;&#1085;&#1095;&#1080;&#1090;&#1100;&#1089;&#1103; &#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1080; &#1089;&#1090;&#1080;&#1093;&#1072;, &#1072; &#1085;&#1077;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083; -
                                      &#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1080; &#1075;&#1083;&#1072;&#1074;&#1099;. &#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1074; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1080;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103;&#1093; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1084;&#1077;&#1089;&#1090;&#1072;&#1093;, &#1095;&#1072;&#1089;&#1090;&#1086; -
                                      &#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1080; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;.
               </p>
            </div>
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d0e113"></a>&#1057;&#1089;&#1099;&#1083;&#1082;&#1080;
                        </h4>
                     </div>
                  </div>
               </div>
               <p>&#1058;&#1077;&#1082;&#1089;&#1090;&#1099; &#1089;&#1089;&#1099;&#1083;&#1072;&#1102;&#1090;&#1089;&#1103; &#1076;&#1088;&#1091;&#1075; &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1072;. &#1057;&#1089;&#1099;&#1083;&#1082;&#1072; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1103;&#1077;&#1090; &#1086;&#1090;&#1088;&#1077;&#1079;&#1086;&#1082; &#1080;&#1083;&#1080; &#1090;&#1086;&#1095;&#1082;&#1091; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086;
                                      &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1089; &#1086;&#1090;&#1088;&#1077;&#1079;&#1082;&#1086;&#1084; &#1080;&#1083;&#1080; &#1090;&#1086;&#1095;&#1082;&#1086;&#1081; &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086;.
               </p>
               <p>&#1057;&#1089;&#1099;&#1083;&#1082;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1084;&#1080; &#1087;&#1086; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1102; &#1082; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;&#1084;, &#1080;&#1084;&#1080; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1103;&#1077;&#1084;&#1099;&#1084;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;,
                                      &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1087;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1084;&#1077;&#1089;&#1090; &#1074; &#1058;&#1072;&#1083;&#1084;&#1091;&#1076;&#1077; &#1080;&#1083;&#1080; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1086;&#1074; &#1064;&#1091;&#1083;&#1093;&#1072;&#1085; &#1040;&#1088;&#1091;&#1093;&#1072; &#1040;&#1083;&#1100;&#1090;&#1077;&#1088; &#1056;&#1077;&#1073;&#1077;.
                                      &#1058;&#1086;&#1083;&#1076;&#1086;&#1089;...
               </p>
               <p>&#1041;&#1099;&#1074;&#1072;&#1102;&#1090; &#1088;&#1072;&#1079;&#1085;&#1099;e &#1090;&#1080;&#1087;&#1099; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082;:</p>
               <div class="itemizedlist">
                  <ul class="itemizedlist" style="list-style-type: disc; ">
                     <li class="listitem">
                        <p>&#1085;&#1072;&#1095;&#1072;&#1083;&#1086; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090; &#1082;&#1086;&#1085;&#1077;&#1094;</p>
                     </li>
                     <li class="listitem">
                        <p>&#1085;&#1072;&#1095;&#1072;&#1083;&#1086; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090; &#1076;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1090;&#1074;&#1086;/&#1080;&#1083;&#1083;&#1102;&#1089;&#1090;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090; &#1082;&#1086;&#1085;&#1094;&#1086;&#1084;</p>
                     </li>
                     <li class="listitem">
                        <p>&#1085;&#1072;&#1095;&#1072;&#1083;&#1086; &#1090;&#1088;&#1072;&#1085;&#1089;&#1082;&#1088;&#1080;&#1073;&#1080;&#1088;&#1091;&#1077;&#1090; &#1082;&#1086;&#1085;&#1077;&#1094;</p>
                     </li>
                  </ul>
               </div>
               <p>"&#1057;&#1080;&#1083;&#1072;" &#1089;&#1089;&#1099;&#1083;&#1082;&#1080;.</p>
            </div>
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d0e134"></a>&#1057;&#1072;&#1084;&#1086;&#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1094;&#1080;&#1080;
                        </h4>
                     </div>
                  </div>
               </div>
               <p>&#1058;&#1080;&#1087; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080;, &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081;&#1089;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1086;&#1081; &#1086;&#1089;&#1086;&#1073;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; - &#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1094;&#1080;&#1103;.</p>
               <p>&#1058;&#1077;&#1082;&#1089;&#1090;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1099; (&#1056;&#1072;&#1096;&#1080; - &#1058;&#1072;&#1083;&#1084;&#1091;&#1076;) &#1080;&#1083;&#1080; &#1089;&#1072;&#1084;&#1080; &#1089;&#1077;&#1073;&#1103;
                                      (&#1058;&#1072;&#1083;&#1084;&#1091;&#1076; - &#1094;&#1080;&#1090;&#1072;&#1090;&#1099; &#1080;&#1079; &#1076;&#1088;&#1077;&#1074;&#1085;&#1080;&#1093; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1099;&#1077; &#1074; &#1085;&#1077;&#1084;). &#1058;&#1077;&#1082;&#1089;&#1090; &#1084;&#1086;&#1078;&#1077;&#1090; &#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;
                                      &#1089;&#1089;&#1099;&#1083;&#1082;&#1080;, &#1080; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1091; (&#1088;&#1072;&#1079;&#1073;&#1080;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; &#1093;&#1072;&#1083;&#1086;&#1093;&#1086;&#1089; &#1074; &#1056;&#1072;&#1084;&#1073;&#1072;&#1084;&#1077;).
               </p>
            </div>
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d0e141"></a>&#1040;&#1074;&#1090;&#1086;&#1088;&#1089;&#1090;&#1074;&#1086;
                        </h4>
                     </div>
                  </div>
               </div>
               <p>&#1053;&#1072;&#1076;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1084;&#1085;&#1086;&#1075;&#1086; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; ("&#1080;&#1079;&#1076;&#1072;&#1085;&#1080;&#1081;") &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;,
                                      &#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1094;&#1080;&#1080;/&#1074;&#1099;&#1074;&#1077;&#1088;&#1082;&#1080;/&#1074;&#1087;&#1077;&#1095;&#1072;&#1090;&#1082;&#1072; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1085;&#1077;&#1082;&#1086;&#1077;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1086;&#1076;&#1085;&#1080;&#1084; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084; - &#1101;&#1090;&#1086;
                                      "&#1080;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077;" (&#1074;&#1077;&#1088;&#1089;&#1080;&#1103;).
               </p>
            </div>
         </div>
         <div class="section">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="d0e146"></a>&#1063;&#1090;&#1086; &#1085;&#1072;&#1076;&#1086; &#1091;&#1084;&#1077;&#1090;&#1100;
                     </h3>
                  </div>
               </div>
            </div>
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d0e149"></a>&#1048;&#1089;&#1090;&#1086;&#1088;&#1080;&#1103; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081; (XXX &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;?)
                        </h4>
                     </div>
                  </div>
               </div>
               <p>&#1050;&#1072;&#1082; source control system - &#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;. &#1053;&#1072;&#1084; &#1073;&#1099; &#1095;&#1090;&#1086;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1087;&#1086;&#1087;&#1088;&#1086;&#1097;&#1077; &#1080;
                                      &#1087;&#1086;&#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1077;&#1081;...
               </p>
               <p>It seems that branching and merging are necessary.</p>
            </div>
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d0e156"></a>&#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1085;&#1099;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;
                        </h4>
                     </div>
                  </div>
               </div>
               <p>&#1042;&#1089;&#1105;, &#1095;&#1090;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1095;&#1077;&#1088;&#1077;&#1079; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;, &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;
                                      &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1080; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1085;&#1099;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; &#1090;&#1086;&#1078;&#1077;.
               </p>
               <p>&#1044;&#1086;&#1089;&#1090;&#1091;&#1087; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072;&#1093;.</p>
               <p>Add/change. Add/change metadata.</p>
               <p>Look into AtomPub, WebDav and distributed source control - say,
                                      Mercurial.
               </p>
            </div>
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d0e167"></a>&#1058;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1081; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;
                        </h4>
                     </div>
                  </div>
               </div>
               <p>&#1057; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;&#1084;&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1084; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1077;.</p>
            </div>
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d0e172"></a>&#1054;&#1073;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1077; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082;
                        </h4>
                     </div>
                  </div>
               </div>
               <p>&#1053;&#1072;&#1076;&#1086; &#1091;&#1084;&#1077;&#1090;&#1100; &#1086;&#1073;&#1088;&#1072;&#1097;&#1072;&#1090;&#1100; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080;, &#1090;.&#1077;. &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090;&#1100;, &#1082;&#1072;&#1082;&#1080;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1082;&#1086;&#1085;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074;
                                      &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1084; &#1080;&#1085;&#1090;&#1077;&#1088;&#1074;&#1072;&#1083;&#1077;.
               </p>
            </div>
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d0e177"></a>&#1071;&#1079;&#1099;&#1082; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;
                        </h4>
                     </div>
                  </div>
               </div>
               <p> TODO </p>
            </div>
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d0e182"></a>&#1058;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1081; &#1087;&#1086;&#1080;&#1089;&#1082;
                        </h4>
                     </div>
                  </div>
               </div>
               <p>&#1044;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1081; &#1087;&#1086;&#1080;&#1089;&#1082; - &#1089; &#1091;&#1095;&#1077;&#1090;&#1086;&#1084; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1099; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074; &#1080; &#1075;&#1088;&#1072;&#1084;&#1084;&#1072;&#1090;&#1080;&#1082;&#1080;
                                      - &#1080; &#1074;&#1089;&#1103;&#1082;&#1080;&#1077; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1087;&#1086;&#1080;&#1089;&#1082;&#1080;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;:
               </p>
               <div class="itemizedlist">
                  <ul class="itemizedlist" style="list-style-type: disc; ">
                     <li class="listitem">
                        <p>&#1087;&#1086; &#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1099;&#1084; &#1089;&#1083;&#1086;&#1074;&#1072;&#1084;</p>
                     </li>
                     <li class="listitem">
                        <p>&#1074;&#1089;&#1077; &#1091;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1085;&#1080;&#1103; &#1085;&#1077;&#1082;&#1086;&#1077;&#1075;&#1086; &#1075;&#1086;&#1088;&#1086;&#1076;&#1072;</p>
                     </li>
                     <li class="listitem">
                        <p>&#1074;&#1089;&#1077; &#1074;&#1099;&#1089;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1072;&#1074;&#1090;&#1086;&#1088;&#1072;</p>
                     </li>
                     <li class="listitem">
                        <p>&#1087;&#1086; &#1090;&#1080;&#1090;&#1091;&#1083;&#1091;</p>
                     </li>
                     <li class="listitem">
                        <p>&#1087;&#1086; &#1088;&#1072;&#1079;&#1085;&#1099;&#1084; &#1103;&#1079;&#1099;&#1082;&#1072;&#1084;</p>
                     </li>
                     <li class="listitem">
                        <p>&#1087;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1084; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;&#1084;</p>
                     </li>
                     <li class="listitem">
                        <p>&#1087;&#1086; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072;&#1084; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;</p>
                     </li>
                     <li class="listitem">
                        <p>&#1073;&#1083;&#1080;&#1079;&#1082;&#1080;&#1077; &#1087;&#1086; "&#1085;&#1072;&#1088;&#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1084;&#1085;&#1077;&#1085;&#1080;&#1102;"</p>
                     </li>
                     <li class="listitem">
                        <p>&#1087;&#1086; "&#1085;&#1072;&#1088;&#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1088;&#1077;&#1081;&#1090;&#1080;&#1085;&#1075;&#1091;"</p>
                     </li>
                  </ul>
               </div>
               <p>&#1042;&#1086;&#1090; &#1089;&#1090;&#1072;&#1090;&#1100;&#1103; &#1087;&#1088;&#1086; &#1087;&#1086;&#1080;&#1089;&#1082; &#1074; &#1072;&#1085;&#1086;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077;: [Information Retrieval from Annotated Textxs]</p>
            </div>
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d0e217"></a>&#1055;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1099;
                        </h4>
                     </div>
                  </div>
               </div>
               <p>&#1059; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1099; &#1087;&#1072;&#1088;&#1072;&#1083;&#1077;&#1083;&#1100;&#1085;&#1099; &#1093;&#1086;&#1090;&#1103; &#1085;&#1080; &#1086;&#1076;&#1080;&#1085; &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1077;&#1084;
                                      &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;:
               </p>
               <div class="itemizedlist">
                  <ul class="itemizedlist" style="list-style-type: disc; ">
                     <li class="listitem">
                        <p>&#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076; &#1080; &#1086;&#1088;&#1080;&#1075;&#1080;&#1085;&#1072;&#1083;</p>
                     </li>
                     <li class="listitem">
                        <p>&#1088;&#1072;&#1079;&#1085;&#1099;&#1077; &#1080;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;</p>
                     </li>
                     <li class="listitem">
                        <p>&#1064;&#1091;&#1083;&#1093;&#1072;&#1085; &#1040;&#1088;&#1091;&#1093; &#1040;&#1083;&#1090;&#1077;&#1088; &#1056;&#1077;&#1073;&#1077; &#1080; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1064;&#1091;&#1083;&#1093;&#1072;&#1085; &#1040;&#1088;&#1091;&#1093;</p>
                     </li>
                  </ul>
               </div>
               <p>&#1053;&#1072;&#1076;&#1086; &#1091;&#1084;&#1077;&#1090;&#1100; &#1089;&#1086;&#1095;&#1077;&#1090;&#1072;&#1090;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090;&#1099; &#1089; &#1087;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1086;&#1081; &#1087;&#1086; &#1101;&#1090;&#1086;&#1081; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1077;.
                                      &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074; &#1074;&#1080;&#1076;&#1077; &#1087;&#1086;&#1076;&#1089;&#1090;&#1088;&#1086;&#1095;&#1085;&#1086;&#1075;&#1086; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072;.
               </p>
               <p>&#1053;&#1072;&#1076;&#1086; &#1091;&#1084;&#1077;&#1090;&#1100; &#1089;&#1089;&#1099;&#1083;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; &#1085;&#1072;&#1073;&#1086;&#1088; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074; &#1089; &#1087;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1086;&#1081;. &#1058;&#1072;&#1082;&#1080;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080;
                                      &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1072;&#1102;&#1090;&#1089;&#1103; &#1085;&#1072; &#1090;&#1086;&#1090; &#1080;&#1083;&#1080; &#1080;&#1085;&#1086;&#1081; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090; (&#1080;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077;; &#1103;&#1079;&#1099;&#1082;; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1077; &#1086;&#1075;&#1083;&#1072;&#1089;&#1086;&#1074;&#1086;&#1082;)
                                      &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1090;&#1077;&#1085;&#1080;&#1081; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;.
               </p>
            </div>
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d0e236"></a>&#1040;&#1074;&#1090;&#1086;&#1088;&#1089;&#1090;&#1074;&#1086;
                        </h4>
                     </div>
                  </div>
               </div>
               <p>XXX "&#1040; &#1086;&#1090; &#1080;&#1084;&#1077;&#1085;&#1080; &#1041;". &#1058;&#1086; &#1078;&#1077; - &#1089; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1084;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;&#1084;&#1080;. &#1057;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077;
                                      &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1080; - &#1090;&#1086;&#1078;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1099;. XXX &#1050;&#1072;&#1082; &#1080; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;.
               </p>
               <p>(&#1061;&#1091;&#1084;&#1072;&#1096; &#1080;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1050;&#1077;&#1090;&#1077;&#1088;) &#1087;&#1086; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1042;&#1072;&#1089;&#1080;; ((&#1056;&#1072;&#1084;&#1073;&#1072;&#1084; &#1075;&#1083;&#1072;&#1079;&#1072;&#1084;&#1080; &#1056;&#1086;&#1096;&#1072;) &#1080;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1056;&#1086;&#1084;&#1084;) &#1087;&#1086;
                                      &#1074;&#1088;&#1089;&#1080;&#1080; &#1055;&#1077;&#1090;&#1080;.
               </p>
               <p>&#1056;&#1072;&#1079;&#1085;&#1080;&#1094;&#1072; &#1084;&#1077;&#1078;&#1076;&#1091; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;&#1084;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; - &#1090;&#1086;&#1078;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;; &#1090;&#1077;&#1082;&#1089;&#1090; &#1089; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080;
                                      &#1088;&#1072;&#1079;&#1085;&#1086;&#1095;&#1090;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;.
               </p>
            </div>
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d0e245"></a>&#1055;&#1077;&#1095;&#1072;&#1090;&#1100;
                        </h4>
                     </div>
                  </div>
               </div>
               <p>&#1055;&#1077;&#1095;&#1072;&#1090;&#1100; &#1085;&#1072;&#1073;&#1086;&#1088;&#1072; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1093; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;</p>
            </div>
         </div>
         <div class="section">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="d0e250"></a>&#1048;&#1085;&#1076;&#1080;&#1074;&#1080;&#1076;&#1091;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103;
                     </h3>
                  </div>
               </div>
            </div>
            <div class="itemizedlist">
               <ul class="itemizedlist" style="list-style-type: disc; ">
                  <li class="listitem">
                     <p>&#1051;&#1080;&#1095;&#1085;&#1072;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1091;&#1095;&#1077;&#1073;&#1099;</p>
                  </li>
                  <li class="listitem">
                     <p>&#1044;&#1085;&#1077;&#1074;&#1085;&#1099;&#1077; &#1091;&#1088;&#1086;&#1082;&#1080; - &#1089; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;&#1102; "&#1076;&#1086;&#1083;&#1075;&#1086;&#1074;"</p>
                  </li>
                  <li class="listitem">
                     <p>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1081; &#1087;&#1086;&#1076;&#1073;&#1086;&#1088;&#1082;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074; &#1082;&#1072;&#1082; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1074;&#1099;&#1073;&#1086;&#1088;&#1082;&#1080; &#1080;&#1079;
                                                &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1077;&#1074; &#1090;&#1072;&#1082; &#1080; &#1080;&#1079; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1074; &#1087;&#1086;&#1080;&#1089;&#1082;&#1072;
                     </p>
                  </li>
                  <li class="listitem">
                     <p>&#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1099;&#1073;&#1086;&#1088;&#1082;&#1080;, &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1080;&#1093; &#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;, &#1088;&#1072;&#1089;&#1087;&#1077;&#1095;&#1072;&#1090;&#1072;&#1090;&#1100;</p>
                  </li>
               </ul>
            </div>
         </div>
         <div class="section">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="d0e266"></a>&#1048;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#1055;&#1077;&#1088;&#1077;&#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;&#1084; - &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1080; &#1095;&#1077;&#1088;&#1077;&#1079; &#1090;&#1072;&#1075;&#1080; (&#1089;&#1084;&#1099;&#1089;&#1083;&#1086;&#1074;&#1086;&#1077;); &#1087;&#1086;&#1080;&#1089;&#1082;; &#1074;&#1099;&#1073;&#1086;&#1088;
                               "&#1092;&#1086;&#1082;&#1091;&#1089;&#1072;": &#1076;&#1072;&#1092;/&#1089;&#1091;&#1075;&#1098;&#1103;; &#1079;&#1072;&#1084;&#1077;&#1090;&#1082;&#1080;: &#1074;&#1085;&#1077;&#1089;&#1090;&#1080;/&#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1084;&#1086;&#1080;; &#1085;&#1077;&#1076;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1075;&#1083;&#1072;&#1074;&#1072;, &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; &#1080;
                               &#1073;&#1083;&#1080;&#1078;&#1072;&#1081;&#1096;&#1080;&#1077; &#1096;&#1080;&#1091;&#1088;&#1080;&#1084;, &#1087;&#1088;&#1086;&#1096;&#1083;&#1099;&#1077; &#1087;&#1086;&#1080;&#1089;&#1082;&#1080; &#1102;&#1079;&#1077;&#1088;&#1072;, &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; &#1087;&#1086;&#1089;&#1090;&#1091;&#1087;&#1083;&#1077;&#1085;&#1080;&#1103; &#1080; &#1090;.&#1076;. &#1054;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;
                               &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076; &#1085;&#1072; &#1089;&#1086;&#1089;&#1077;&#1076;&#1085;&#1080;&#1077; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1099; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;, &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1080; &#1082; &#1085;&#1077;&#1084;&#1091; (&#1082; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1084;&#1091;
                               &#1102;&#1079;&#1077;&#1088;&#1086;&#1084; &#1086;&#1090;&#1088;&#1099;&#1074;&#1082;&#1091;), &#1087;&#1086;&#1076;&#1085;&#1103;&#1090;&#1080;&#1077; &#1082; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1091;&#1077;&#1084;&#1091;&#1084; &#1080;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;, &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1099; &#1080; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099;. &#1057;&#1087;&#1080;&#1089;&#1086;&#1082;
                               &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1085;&#1099;&#1093; &#1089;&#1077;&#1075;&#1086;&#1076;&#1085;&#1103; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;. "&#1088;&#1072;&#1073;&#1086;&#1095;&#1080;&#1081; &#1089;&#1090;&#1086;&#1083;": &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1099; &#1080; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1083;&#1080;&#1089;&#1090; &#1076;&#1083;&#1103;
                               &#1079;&#1072;&#1087;&#1080;&#1089;&#1077;&#1081; &#1102;&#1079;&#1077;&#1088;&#1072; - &#1087;&#1083;&#1072;&#1085; &#1091;&#1088;&#1086;&#1082;&#1072; &#1080;&#1083;&#1080; &#1093;&#1080;&#1076;&#1091;&#1096; (&#1082;&#1086;&#1085;&#1089;&#1087;&#1077;&#1082;&#1090; &#1087;&#1088;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;). Google
                                   Notebook.&nbsp;<a class="link" href="http://www.jotspace.com/" target="_top">JotSpace</a>.
            </p>
            <p>&#1054;&#1090;&#1077;&#1094; &#1089;&#1077;&#1084;&#1077;&#1081;&#1089;&#1090;&#1074;&#1072; &#1093;&#1086;&#1095;&#1077;&#1090; &#1087;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1080;&#1090;&#1100; &#1089;&#1091;&#1073;&#1073;&#1086;&#1090;&#1085;&#1080;&#1081; &#1088;&#1072;&#1079;&#1075;&#1086;&#1074;&#1086;&#1088;. &#1052;&#1099; &#1087;&#1086;&#1084;&#1085;&#1080;&#1084; &#1077;&#1075;&#1086; &#1083;&#1102;&#1073;&#1080;&#1084;&#1099;&#1093;
                               &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074; , &#1077;&#1084;&#1091; &#1086;&#1085;&#1080; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1099; &#1085;&#1072; "&#1089;&#1090;&#1086;&#1083;&#1077;", &#1087;&#1088;&#1080; &#1078;&#1077;&#1083;&#1072;&#1085;&#1080;&#1080; &#1086;&#1085; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077;
                               &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1099; &#1085;&#1072; "&#1087;&#1086;&#1083;&#1082;&#1077;", &#1074;&#1099;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1077;&#1090; &#1087;&#1086;&#1085;&#1088;&#1072;&#1074;&#1080;&#1074;&#1096;&#1080;&#1077;&#1089;&#1103; &#1085;&#1072; &#1083;&#1080;&#1089;&#1090;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;
                               &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074; &#1076;&#1083;&#1103; &#1076;&#1077;&#1090;&#1077;&#1081;. &#1058;&#1077;&#1082;&#1089;&#1090; &#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1080;&#1076;&#1091;&#1090; &#1074; &#1086;&#1076;&#1085;&#1086;&#1084; &#1087;&#1086;&#1090;&#1086;&#1082;&#1077;
            </p>
            <p>&#1055;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1072; &#1076;&#1088;&#1072;&#1096;&#1080; &#1082; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1102;. &#1070;&#1079;&#1077;&#1088; &#1074;&#1099;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090; &#1080;&#1079; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; (&#1073;&#1072;&#1088; &#1084;&#1080;&#1094;&#1074;&#1072;, &#1073;&#1072;&#1090; &#1084;&#1080;&#1094;&#1074;&#1072;, &#1073;&#1088;&#1080;&#1090;,
                               &#1089;&#1080;&#1102;&#1084; ...) &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;, &#1079;&#1072;&#1090;&#1077;&#1084; &#1080;&#1079; &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; - &#1096;&#1080;&#1091;&#1088;&#1080;&#1084; &#1077;&#1084;&#1091; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1103;&#1096;&#1080;&#1077; (&#1085;&#1077;&#1076;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1075;&#1083;&#1072;&#1074;&#1072;,
                               &#1058;&#1072;&#1085;&#1080;&#1103;, &#1056;&#1072;&#1084;&#1073;&#1072;&#1084;, &#1073;&#1083;&#1080;&#1078;&#1072;&#1081;&#1096;&#1080;&#1077; &#1087;&#1088;&#1072;&#1079;&#1076;&#1085;&#1080;&#1082;&#1080;) &#1080; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072; &#1086;&#1085; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090; &#1085;&#1072;&#1073;&#1086;&#1088;
                               &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;.
            </p>
            <p>K&#1088;&#1086;&#1084;&#1077; &#1087;&#1086;&#1073;&#1086;&#1088;&#1072; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; "&#1092;&#1086;&#1088;&#1091;&#1084;&#1072;" &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1085;&#1072;&#1076;&#1086;&#1073;&#1080;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1089;&#1085;&#1080;&#1084;&#1086;&#1082; &#1083;&#1080;&#1089;&#1090;&#1072;
                               &#1043;&#1077;&#1084;&#1072;&#1088;&#1099;.
            </p>
            <p>&#1044;&#1083;&#1103; &#1091;&#1088;&#1086;&#1082;&#1072; &#1074; &#1077;&#1096;&#1080;&#1074;&#1077; &#1090;&#1080;&#1093;&#1086;&#1085;&#1080;&#1090; &#1091;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100; &#1084;&#1086;&#1078;&#1077;&#1090; &#1079;&#1072;&#1093;&#1086;&#1090;&#1077;&#1090;&#1100; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1074;&#1080;&#1076;&#1077;-&#1072;&#1091;&#1076;&#1080;&#1086;&#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1099; &#1080;
                               &#1088;&#1072;&#1079;&#1085;&#1099;&#1077; &#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1082;&#1080;. (&#1055;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080; &#1082; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1084; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1072;&#1084; &#1085;&#1072;&#1076;&#1086; &#1087;&#1088;&#1086;&#1076;&#1091;&#1084;&#1072;&#1090;&#1100; &#1087;&#1086;&#1083;&#1080;&#1090;&#1080;&#1082;&#1091;
                               &#1094;&#1077;&#1085;&#1079;&#1091;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1076;&#1086;&#1089;&#1086;&#1074; &#1085;&#1077; &#1089;&#1087;&#1091;&#1075;&#1085;&#1091;&#1090;&#1100;)
            </p>
            <p>&#1055;&#1088;&#1077;&#1079;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;.</p>
         </div>
         <div class="section">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="d0e284"></a>&#1050;&#1086;&#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103;
                     </h3>
                  </div>
               </div>
            </div>
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d0e287"></a>&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1077;: &#1074;&#1089;&#1105;
                        </h4>
                     </div>
                  </div>
               </div>
               <p>&#1042;&#1087;&#1077;&#1095;&#1072;&#1090;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;</p>
               <p>&#1042;&#1099;&#1074;&#1077;&#1088;&#1082;&#1072; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;: Wikipedia, Wikisource, Distributed Proofreaders</p>
               <p>&#1056;&#1072;&#1079;&#1084;&#1077;&#1090;&#1082;&#1072; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;</p>
               <p>&#1055;&#1088;&#1086;&#1074;&#1103;&#1079;&#1082;&#1072; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;</p>
               <p>&#1040;&#1085;&#1085;&#1086;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;</p>
               <p>&#1053;&#1086;&#1074;&#1099;&#1077; &#1089;&#1090;&#1080;&#1083;&#1080; &#1087;&#1086;&#1076;&#1072;&#1095;&#1080; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; (XProc/XQuery/XSLT)</p>
               <p>&#1053;&#1086;&#1074;&#1099;&#1077; &#1089;&#1090;&#1080;&#1083;&#1080; &#1087;&#1077;&#1095;&#1072;&#1090;&#1080;</p>
            </div>
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d0e304"></a>&#1056;&#1072;&#1079;&#1085;&#1086;&#1077;
                        </h4>
                     </div>
                  </div>
               </div>
               <p>&#1044;&#1080;&#1089;&#1090;&#1072;&#1085;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; (web)</p>
               <p>&#1048;&#1085;&#1090;&#1077;&#1075;&#1088;&#1072;&#1094;&#1080;&#1103; &#1089; &#1073;&#1083;&#1086;&#1075;&#1072;&#1084;&#1080;</p>
               <p>Wikipedia</p>
               <p>Live Journal</p>
               <p>Del.icio.us</p>
               <p>Digital libraries</p>
               <p>&#1070;&#1088;&#1080;&#1089;&#1090;&#1099;</p>
               <p>&#1060;&#1086;&#1088;&#1091;&#1084;&#1099; &#1076;&#1083;&#1103; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;: Wikipedia</p>
               <p>&#1047;&#1072;&#1097;&#1080;&#1090;&#1072; &#1086;&#1090; &#1089;&#1072;&#1073;&#1086;&#1090;&#1072;&#1078;&#1072;: Wikipedia</p>
               <p>Citizendium [64]</p>
               <p><a class="link" href="http://Fmany.corante.com/archives/2006/09/18/larry_sanger_citizendium_and_the_problem_of_expertise.php" target="_top">http://many.corante.com/archives/2006/09/18/larry_sanger_citizendium_and_the_problem_of_expertise.php</a></p>
               <p><a class="link" href="http://many.corante.com/archives/2006/09/20/larry_sanger_on_me_on_citizendium.php" target="_top">http://many.corante.com/archives/2006/09/20/larry_sanger_on_me_on_citizendium.php</a></p>
               <p>&#1059;&#1088;&#1086;&#1074;&#1085;&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1087;&#1086; &#1088;&#1077;&#1087;&#1091;&#1090;&#1072;&#1094;&#1080;&#1080;/&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1103;&#1084; (&#1072;&#1085;&#1086;&#1085;&#1080;&#1084;&#1085;&#1099;&#1081;, &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081;,
                                      &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;)
               </p>
               <p>&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;, &#1089;&#1086;&#1090;&#1074;&#1086;&#1088;&#1080; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1072;</p>
            </div>
         </div>
         <div class="section">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="d0e337"></a>&#1050;&#1086;&#1084;&#1077;&#1088;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1091;&#1077;&#1084;&#1086;&#1089;&#1090;&#1100;/&#1055;&#1088;&#1080;&#1074;&#1083;&#1077;&#1082;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;
                     </h3>
                  </div>
               </div>
            </div>
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d0e340"></a>&#1063;&#1091;&#1074;&#1089;&#1090;&#1074;&#1086; &#1074;&#1080;&#1085;&#1099;
                        </h4>
                     </div>
                  </div>
               </div>
               <p>&#1053;&#1072;&#1096;&#1072; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1089;&#1090;&#1072;&#1090;&#1100; &#1095;&#1072;&#1089;&#1090;&#1100;&#1102; &#1077;&#1074;&#1088;&#1077;&#1081;&#1089;&#1082;&#1086;&#1081; &#1082;&#1091;&#1083;&#1100;&#1090;&#1091;&#1088;&#1099;. &#1041;&#1086;&#1093;&#1091;&#1088;, &#1085;&#1077; &#1074;&#1079;&#1103;&#1074;&#1096;&#1080;&#1081; &#1096;&#1077;&#1092;&#1089;&#1090;&#1074;&#1072;
                                      &#1085;&#1072;&#1076; &#1083;&#1080;&#1089;&#1090;&#1086;&#1084; &#1090;&#1072;&#1083;&#1084;&#1091;&#1076;&#1072; &#1080;&#1083;&#1080; &#1075;&#1083;&#1072;&#1074;&#1086;&#1081; &#1088;&#1080;&#1096;&#1086;&#1085;&#1072; &#1089;&#1090;&#1072;&#1085;&#1077;&#1090; &#1080;&#1079;&#1075;&#1086;&#1077;&#1084;. &#1057; &#1080;&#1079;&#1076;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1090;&#1074;&#1086;&#1084;, &#1085;&#1077;
                                      &#1087;&#1086;&#1076;&#1072;&#1088;&#1080;&#1074;&#1096;&#1080;&#1084; &#1085;&#1072;&#1084; 10 &#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1085;&#1099;&#1093; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074; &#1085;&#1080;&#1082;&#1090;&#1086; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1076;&#1077;&#1083;&#1072;. &#1042;&#1089;&#1077; &#1089;&#1087;&#1086;&#1085;&#1089;&#1086;&#1088;&#1099;
                                      &#1073;&#1091;&#1076;&#1091;&#1090; &#1085;&#1072;&#1096;&#1080; - &#1091; &#1085;&#1072;&#1089; &#1074;&#1080;&#1076;&#1085;&#1086; &#1074;&#1089;&#1077;&#1084;&#1091; &#1089;&#1074;&#1077;&#1090;&#1091;. &#1047;&#1072;&#1087;&#1086;&#1074;&#1077;&#1076;&#1100; &#1086; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1080; &#1058;&#1086;&#1088;&#1099; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100; &#1093;&#1086;&#1076;&#1080;&#1090;&#1100;
                                      &#1073;&#1091;&#1076;&#1091;&#1090; &#1082; &#1085;&#1072;&#1084;. &#1061;&#1072;&#1089;&#1082;&#1086;&#1084;&#1086;&#1089; &#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1073;&#1091;&#1076;&#1091;&#1090; &#1095;&#1077;&#1088;&#1077;&#1079; &#1085;&#1072;&#1089;. &#1061;&#1080;&#1076;&#1091;&#1096;&#1080;&#1084; &#1087;&#1077;&#1095;&#1072;&#1090;&#1072;&#1090;&#1100; &#1073;&#1091;&#1076;&#1091;&#1090; &#1091; &#1085;&#1072;&#1089; - &#1082;&#1072;&#1082;
                                      &#1092;&#1080;&#1079;&#1080;&#1082;&#1080; &#1074; arXiv&#1077;.
               </p>
               <p>&#1059;&#1074;&#1077;&#1082;&#1086;&#1074;&#1077;&#1095;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1077;&#1073;&#1103; (&#1080;&#1083;&#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1083;&#1102;&#1076;&#1077;&#1081;) &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;&#1093; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;.</p>
            </div>
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d0e347"></a>&#1043;&#1088;&#1072;&#1076;&#1091;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1087;&#1083;&#1072;&#1090;&#1085;&#1099;&#1077; &#1091;&#1089;&#1083;&#1091;&#1075;&#1080;
                        </h4>
                     </div>
                  </div>
               </div>
               <p>&#1055;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1091;&#1089;&#1083;&#1091;&#1075; &#1079;&#1072; &#1076;&#1077;&#1085;&#1100;&#1075;&#1080;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1093;&#1086;&#1088;&#1086;&#1096;&#1072;&#1103; &#1087;&#1077;&#1095;&#1072;&#1090;&#1100;. &#1048;&#1083;&#1080; -
                                      &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; "&#1089;&#1091;&#1087;&#1077;&#1088;&#1074;&#1099;&#1074;&#1077;&#1088;&#1077;&#1085;&#1085;&#1099;&#1084;" &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;&#1084;.
               </p>
            </div>
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d0e352"></a>Google
                        </h4>
                     </div>
                  </div>
               </div>
               <p>&#1048;&#1085;&#1076;&#1080;&#1074;&#1080;&#1076;&#1091;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103;: GData.</p>
               <p>&#1057;&#1082;&#1072;&#1085;&#1099;.</p>
               <p>&#1061;&#1086;&#1088;&#1086;&#1096;&#1086; &#1073;&#1099; - &#1080;&#1093; &#1093;&#1086;&#1089;&#1090;&#1080;&#1085;&#1075;.</p>
               <p>&#1045;&#1097;&#1105; &#1083;&#1091;&#1095;&#1096;&#1077; - &#1079;&#1072; &#1080;&#1093; &#1076;&#1077;&#1085;&#1100;&#1075;&#1080;.</p>
            </div>
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d0e363"></a>&#1056;&#1072;&#1079;&#1085;&#1086;&#1077;
                        </h4>
                     </div>
                  </div>
               </div>
               <p>&#1050;&#1089;&#1102;&#1093;&#1080;&#1085;&#1072; &#1080;&#1076;&#1077;&#1103;: &#1070;&#1088;&#1080;&#1089;&#1090;&#1099; &#1082;&#1072;&#1082; &#1088;&#1099;&#1085;&#1086;&#1082; &#1076;&#1083;&#1103; &#1089;&#1077;&#1088;&#1100;&#1077;&#1079;&#1085;&#1099;&#1093; &#1076;&#1077;&#1085;&#1077;&#1075;?</p>
               <p>&#1055;&#1072;&#1090;&#1077;&#1085;&#1090;</p>
               <p>&#1044;&#1086;&#1074;&#1077;&#1089;&#1086;&#1082; &#1082; &#1073;&#1091;&#1084;&#1072;&#1078;&#1085;&#1086;&#1081; &#1082;&#1085;&#1080;&#1075;&#1077;</p>
            </div>
         </div>
         <div class="section">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="d0e372"></a>&#1057;&#1074;&#1103;&#1079;&#1072;&#1085;&#1099;&#1077; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;
                     </h3>
                  </div>
               </div>
            </div>
            <p>TODO</p>
         </div>
         <div class="section">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="d0e377"></a>&#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1077; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099;
                     </h3>
                  </div>
               </div>
            </div>
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d0e380"></a>&#1048;&#1084;&#1103; &#1076;&#1086;&#1084;&#1077;&#1085;&#1072;
                        </h4>
                     </div>
                  </div>
               </div>
               <p>&#1050;&#1072;&#1082; &#1085;&#1072;&#1079;&#1074;&#1072;&#1090;&#1100;? &#1050;&#1086;&#1088;&#1080;&#1094; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1080;&#1083; &#1076;&#1074;&#1072;:&nbsp;OpenTorah&nbsp;&#1080; "&#1058;&#1086;&#1088;&#1072;&#1090; &#1052;&#1086;&#1096;&#1077;".</p>
            </div>
         </div>
         <div class="bibliography">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="d0e385"></a>Sources
                     </h3>
                  </div>
               </div>
            </div>
            <div class="biblioentry"><a name="Fraenkel97"></a><p>[Fraenkel97] <span class="title"><i>The Responsa storage and retrieval system-whither?.</i>. </span><span class="author"><span class="firstname">Aviezri</span> <span class="surname">Fraenkel</span>. </span><span class="date">1997. </span><span class="biblioid">http://www.wisdom.weizmann.ac.il/~fraenkel/Papers/trs.ps. </span><span class="biblioid">http://www.wisdom.weizmann.ac.il/~fraenkel/Papers/pha.ps. </span></p>
            </div>
            <div class="biblioentry"><a name="CAB"></a><p>[CAB] <span class="title"><i>The Cathedral and the Bazaar</i>. </span><span class="author"><span class="firstname">Eric</span> <span class="othername">S</span> <span class="surname">Raymond</span>. </span><span class="biblioid">http://www.catb.org/~esr/writings/homesteading. </span></p>
            </div>
            <div class="biblioentry"><a name="Ontology"></a><p>[Ontology] <span class="title"><i>Ontology is overrated</i>. </span><span class="author"><span class="firstname">Clay</span> <span class="surname">Shirky</span>. </span><span class="date">2005. </span><span class="biblioid">http://www.shirky.com/writings/ontology_overrated.html. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e429"></a><p><span class="title"><i>Distributed Proofreaders</i>. </span><span class="biblioid">http://www.pgdp.net/c/default.php". </span></p>
            </div>
            <div class="biblioentry"><a name="d0e434"></a><p><span class="title"><i>TEI Lite Tutorial</i>. </span><span class="biblioid">http://www.tei-c.org/Lite/teiu5_split_en.html. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e439"></a><p><span class="title"><i>TEI P5</i>. </span><span class="biblioid">http://www.tei-c.org/release/doc/tei-p5-doc/html/. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e444"></a><p><span class="title"><i>TEI CE</i>. </span><span class="biblioid">http://www.tei-c.org/Activities/CE/. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e449"></a><p><span class="title"><i>TEI Overlap</i>. </span><span class="biblioid">http://www.tei-c.org/Activities/SIG/Overlap/. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e454"></a><p><span class="title"><i>TEI WD</i>. </span><span class="biblioid">http://www.tei-c.org/release/doc/tei-p5-doc/html/WD.html. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e459"></a><p><span class="title"><i>TEI NH</i>. </span><span class="biblioid">http://www.tei-c.org/release/doc/tei-p5-doc/html/NH.html. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e464"></a><p><span class="title"><i>TEI I18N</i>. </span><span class="biblioid">http://www.tei-c.org/I18N/. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e469"></a><p><span class="title"><i>TEI Roma</i>. </span><span class="biblioid">http://tei.oucs.ox.ac.uk/Roma/. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e474"></a><p><span class="title"><i>?</i>. </span><span class="biblioid">http://www.w3.org/People/cmsmcq/2000/poddp2000.html. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e479"></a><p><span class="title"><i>?</i>. </span><span class="biblioid">http://www.mulberrytech.com/Extreme/Proceedings/html/2004/DeRose01/EML2004DeRose01.html. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e484"></a><p><span class="title"><i>?</i>. </span><span class="biblioid">http://www.idealliance.org/papers/extreme/Proceedings/html/2005/Bauman01/EML2005Bauman01.html. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e489"></a><p><span class="title"><i>?</i>. </span><span class="biblioid">http://www.tei-c.org.uk/wiki/index.php/SIG:Overlap. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e494"></a><p><span class="title"><i>?</i>. </span><span class="biblioid">http://www.tei-c.org/wiki/index.php/Talk:SIG:Overlap. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e499"></a><p><span class="title"><i>?</i>. </span><span class="biblioid">http://www.tei-c.org/Talks/OUCS/2005-02/talk-access.pdf. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e504"></a><p><span class="title"><i>Subversion</i>. </span><span class="biblioid">http://subversion.tigris.org/. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e509"></a><p><span class="title"><i>eXist XML database</i>. </span><span class="biblioid">http://exist.sourceforge.net/. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e514"></a><p><span class="title"><i>JXHTMLEDIT</i>. </span><span class="biblioid">http://www.tecnick.com/public/code/cp_dpage.php?aiocp_dp=jxhtmledit. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e519"></a><p><span class="title"><i>Syntext Serna</i>. </span><span class="biblioid">http://www.syntext.com/products/serna/index.htm. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e524"></a><p><span class="title"><i>Stylus Studio</i>. </span><span class="biblioid">http://www.stylusstudio.com/. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e529"></a><p><span class="title"><i>ALTOVA xmlspy</i>. </span><span class="biblioid">http://www.altova.com/. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e534"></a><p><span class="title"><i>oXygen</i>. </span><span class="biblioid">http://www.oxygenxml.com/. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e539"></a><p><span class="title"><i>Exchanger XML</i>. </span><span class="biblioid">http://www.exchangerxml.com/editor/. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e544"></a><p><span class="title"><i>editix</i>. </span><span class="biblioid">http://www.editix.com/. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e549"></a><p><span class="title"><i>topologi</i>. </span><span class="biblioid">http://www.topologi.com/. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e554"></a><p><span class="title"><i>Ajax</i>. </span><span class="biblioid">http://en.wikipedia.org/wiki/AJAX. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e559"></a><p><span class="title"><i>Applets</i>. </span><span class="biblioid">http://jroller.com/page/tackline?entry=using_applets_in_place_of. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e564"></a><p><span class="title"><i>Applets</i>. </span><span class="biblioid">http://weblogs.java.net/blog/chet/applet-jax/Yapplet.html. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e569"></a><p><span class="title"><i>Thank God - Java EE Is Not Like Ajax</i>. </span><span class="biblioid">http://www.coachwei.com/blog/_archives/2006/9/27/2367882.html. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e574"></a><p><span class="title"><i>Unicode</i>. </span><span class="biblioid">http://www.unicode.org/. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e579"></a><p><span class="title"><i>Unicode</i>. </span><span class="biblioid">http://www.w3.org/International/articles/inline-bidi-markup/. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e584"></a><p><span class="title"><i>XML</i>. </span><span class="biblioid">http://www.xml.com/axml/testaxml.htm. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e589"></a><p><span class="title"><i>XLink</i>. </span><span class="biblioid">http://www.xml.com/pub/a/2002/03/13/xlink.html. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e594"></a><p><span class="title"><i>Wikipedia: Tim Bray</i>. </span><span class="biblioid">http://en.wikipedia.org/wiki/Tim_Bray. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e599"></a><p><span class="biblioid">http://www.w3.org/People/cmsmcq/. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e602"></a><p><span class="title"><i>Theological Markup Language</i>. </span><span class="biblioid">http://www.ccel.org/ThML/ThML1.04.htm. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e607"></a><p><span class="title"><i>Tanakh ML</i>. </span><span class="biblioid">http://tanakhml2.alacartejava.net/cocoon/tanakhml/index.htm. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e612"></a><p><span class="title"><i>Open Scripture Information Standard</i>. </span><span class="biblioid">http://en.wikipedia.org/wiki/Open_Scripture_Information_Standard. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e617"></a><p><span class="title"><i>Project Gutenberg</i>. </span><span class="biblioid">http://www.gutenberg.org. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e622"></a><p><span class="title"><i>Citizendium</i>. </span><span class="biblioid">http://www.citizendium.org/cfa.html. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e627"></a><p><span class="title"><i>No new XML languages</i>. </span><span class="biblioid">http://www.tbray.org/ongoing/When/200x/2006/01/08/No-New-XML-Languages. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e632"></a><p><span class="biblioid">http://www.unicode.org/charts/PDF/U0100.pdf. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e635"></a><p><span class="biblioid">http://www.unicode.org/charts/PDF/U0590.pdf. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e638"></a><p><span class="title"><i>Topic Maps</i>. </span><span class="biblioid">http://en.wikipedia.org/wiki/Topic_map. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e643"></a><p><span class="title"><i>?</i>. </span><span class="biblioid">http://www.ontopia.net/topicmaps/materials/tmrdf.html. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e648"></a><p><span class="title"><i>Information retrieval from annotated texts.</i>. </span><span class="authorgroup">A.S. Fraenkel and S.T. Klein. J.. </span><span class="publisher"><span class="publishername">Amer. Soc. for Information Sciences. 50. 1999. 845&#8211;854.. </span></span><span class="biblioid">http://www.wisdom.weizmann.ac.il/~fraenkel/Papers/annot.ps. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e663"></a><p><span class="biblioid">http://scripts.sil.org/cms/scripts/page.php?site_id=nrsi&amp;item_id=XSEM. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e666"></a><p><span class="biblioid">http://books.chabadlibrary.org/default.aspx. </span></p>
            </div>
            <div class="biblioentry"><a name="d0e669"></a><p><span class="title"><i>&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1090;&#1086;&#1075;&#1086; &#1082;&#1072;&#1082; &#1080;&#1079; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1072;&#1085;&#1085;&#1086;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1074; XML&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; HTML</i>. </span></p>
            </div>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="ar01s01.html">Prev</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="ar01s03.html">Next</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">Introduction&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td>
               <td width="40%" align="right" valign="top">&nbsp;Implementation</td>
            </tr>
         </table>
      </div>
   </body>
</html>