<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
   
      <title>Implementation</title>
      <link rel="stylesheet" type="text/css" href="css/docBook.css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.79.1">
      <link rel="home" href="index.html" title="Digital Judaica Done Right">
      <link rel="up" href="index.html" title="Digital Judaica Done Right">
      <link rel="prev" href="dream.html" title="What do we want? (The Dream)">
      <link rel="next" href="laying-out.html" title="Laying out classic Jewish texts">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">Implementation</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="dream.html">Prev</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="laying-out.html">Next</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="section">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="implementation"></a>Implementation
                  </h2>
               </div>
            </div>
         </div>
                 
                 
         <div class="section">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="d5e408"></a>Approach
                     </h3>
                  </div>
               </div>
            </div>
                        
                        
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d5e410"></a>&#1054; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1072;&#1093;
                        </h4>
                     </div>
                  </div>
               </div>
                               
                               
               <p>&#1045;&#1089;&#1083;&#1080; &#1077;&#1089;&#1090;&#1100; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;, &#1090;&#1086; &#1103;&#1089;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1083;&#1091;&#1095;&#1096;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086;, &#1095;&#1077;&#1084; &#1089;&#1074;&#1086;&#1105;,
                  &#1076;&#1086;&#1084;&#1086;&#1088;&#1086;&#1097;&#1077;&#1085;&#1085;&#1086;&#1077;. &#1042;&#1099;&#1075;&#1086;&#1076;&#1072; &#1086;&#1090; &#1101;&#1090;&#1086;&#1075;&#1086; &#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1072;: &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1089;&#1077;&#1084;&#1080; (&#1080;&#1083;&#1080;
                  &#1084;&#1085;&#1086;&#1075;&#1080;&#1084;&#1080;), &#1072; &#1076;&#1086;&#1084;&#1086;&#1088;&#1086;&#1097;&#1077;&#1085;&#1085;&#1086;&#1077; - &#1085;&#1080;&#1082;&#1077;&#1084;; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1102;&#1097;&#1080;&#1077; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103;
                  &#1096;&#1080;&#1088;&#1086;&#1082;&#1086; &#1080; &#1086;&#1090;&#1083;&#1072;&#1078;&#1077;&#1085;&#1099; &#1083;&#1091;&#1095;&#1096;&#1077;, &#1095;&#1077;&#1084; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1090;&#1083;&#1072;&#1078;&#1077;&#1085;&#1099; &#1076;&#1086;&#1084;&#1086;&#1088;&#1086;&#1097;&#1077;&#1085;&#1085;&#1099;&#1077; (&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1077;&#1097;&#1105; &#1080; &#1087;&#1080;&#1089;&#1072;&#1090;&#1100;
                  &#1087;&#1088;&#1080;&#1076;&#1077;&#1090;&#1089;&#1103;); &#1083;&#1102;&#1076;&#1080; &#1087;&#1088;&#1086; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090; &#1089;&#1083;&#1099;&#1096;&#1072;&#1083;&#1080; &#1080; &#1079;&#1085;&#1072;&#1102;&#1090;, &#1082;&#1072;&#1082; &#1089; &#1085;&#1080;&#1084; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1080; &#1090;.&#1076;. &#1053;&#1086;
                  &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1077; - &#1089;&#1072;&#1084; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;, &#1073;&#1091;&#1076;&#1091;&#1095;&#1080; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1084; &#1095;&#1091;&#1076;&#1086;&#1074;&#1080;&#1097;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072; &#1090;&#1088;&#1091;&#1076;&#1072;
                                      &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1080;&#1089;&#1090;&#1086;&#1074;, &#1082;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086; "&#1086;&#1090;&#1083;&#1072;&#1078;&#1077;&#1085;" &#1083;&#1091;&#1095;&#1096;&#1077;, &#1095;&#1077;&#1084; &#1083;&#1102;&#1073;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1085;&#1072;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072;.
               </p>
                               
               <p>&#1041;&#1099;&#1074;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090; "&#1085;&#1077; &#1087;&#1088;&#1080;&#1078;&#1080;&#1083;&#1089;&#1103;". &#1058;&#1086;&#1075;&#1076;&#1072; &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1080;&#1079; &#1074;&#1099;&#1075;&#1086;&#1076; &#1086;&#1090; &#1077;&#1075;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;
                                      &#1087;&#1088;&#1086;&#1087;&#1072;&#1076;&#1072;&#1102;&#1090;. &#1053;&#1086; &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1090;&#1086; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1077;&#1089;&#1090;&#1100; "&#1087;&#1088;&#1080;&#1078;&#1080;&#1074;&#1096;&#1080;&#1081;&#1089;&#1103;" &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;, &#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1086;, &#1095;&#1090;&#1086;
                                      &#1080;&#1075;&#1085;&#1086;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1086;&#1095;&#1077;&#1085;&#1100; &#1075;&#1083;&#1091;&#1087;&#1086;. &#1053;&#1077;&#1089;&#1084;&#1086;&#1090;&#1088;&#1103; &#1085;&#1072; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1080;&#1079;-&#1079;&#1072; "&#1082;&#1086;&#1084;&#1080;&#1090;&#1077;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080;"
                                      &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1086;&#1074; &#1074; &#1085;&#1080;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1082;&#1086;&#1084;&#1087;&#1088;&#1086;&#1084;&#1080;&#1089;&#1099;, &#1072; &#1080;&#1079;-&#1079;&#1072; &#1076;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;
                                      &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1072; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; "&#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1077; &#1089;&#1083;&#1086;&#1074;&#1086;" &#1074; &#1085;&#1080;&#1093; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080; &#1085;&#1077; &#1086;&#1090;&#1088;&#1072;&#1078;&#1077;&#1085;&#1086;.
               </p>
                           
            </div>
                        
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d5e414"></a>&#1058;&#1077;&#1082;&#1089;&#1090;&#1099; &#1085;&#1072; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1103;&#1079;&#1099;&#1082;&#1072;&#1093;, &#1089;&#1087;&#1088;&#1072;&#1074;&#1072; &#1085;&#1072; &#1083;&#1077;&#1074;&#1086;, &#1089; &#1082;&#1072;&#1085;&#1090;&#1080;&#1083;&#1103;&#1094;&#1080;&#1077;&#1081;...
                        </h4>
                     </div>
                  </div>
               </div>
                               
                               
               <p>&#1071;&#1089;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074; Unicode [53]. &#1055;&#1088;&#1080;&#1076;&#1091;&#1084;&#1099;&#1074;&#1072;&#1090;&#1100; &#1089;&#1074;&#1086;&#1102; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1082;&#1091;
                                      &#1085;&#1077;&#1088;&#1072;&#1079;&#1091;&#1084;&#1085;&#1086;.
               </p>
                               
               <p>&#1071;&#1089;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074; XML&#1077; [55] [1] , &#1085;&#1077;&#1089;&#1084;&#1086;&#1090;&#1088;&#1103; &#1085;&#1072; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1086;&#1085; &#1085;&#1077;
                                      &#1088;&#1072;&#1089;&#1089;&#1095;&#1080;&#1090;&#1072;&#1085; &#1085;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; (&#1089;&#1084;. &#1085;&#1080;&#1078;&#1077;). &#1058;&#1077;&#1084; &#1085;&#1077;
                                      &#1084;&#1077;&#1085;&#1077;&#1077;, &#1087;&#1088;&#1080;&#1076;&#1091;&#1084;&#1099;&#1074;&#1072;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081;, "&#1091;&#1083;&#1091;&#1095;&#1096;&#1077;&#1085;&#1085;&#1099;&#1081;" XML &#1085;&#1077;&#1088;&#1072;&#1079;&#1091;&#1084;&#1085;&#1086;.
               </p>
                           
            </div>
                        
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d5e418"></a>TEI
                        </h4>
                     </div>
                  </div>
               </div>
                               
                               
               <p>&#1054;&#1076;&#1080;&#1085; &#1080;&#1079; &#1072;&#1074;&#1090;&#1086;&#1088;&#1086;&#1074; XML&#1072;, &#1058;&#1080;&#1084; &#1041;&#1088;&#1072;&#1081; [58], &#1074;&#1077;&#1083;&#1080;&#1090; &#1085;&#1077; &#1080;&#1079;&#1086;&#1073;&#1088;&#1077;&#1090;&#1072;&#1090;&#1100; &#1089;&#1074;&#1086;&#1080;&#1093; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1086;&#1074; XML&#1072;,
                                      &#1072; &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1086;&#1076;&#1085;&#1080;&#1084; &#1080;&#1079; &#1087;&#1103;&#1090;&#1080; "&#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093;" [65]. &#1042; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1074; XML&#1077;
                                      "&#1075;&#1091;&#1084;&#1072;&#1085;&#1080;&#1090;&#1072;&#1088;&#1085;&#1099;&#1093;" (&#1080;&#1079;&#1074;&#1080;&#1085;&#1080;&#1090;&#1077; &#1079;&#1072; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;) &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074; &#1077;&#1089;&#1090;&#1100; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090; (&#1085;&#1077; &#1074;&#1082;&#1083;&#1102;&#1095;&#1105;&#1085;&#1085;&#1099;&#1081;
                                      &#1041;&#1088;&#1072;&#1077;&#1084; &#1074; &#1095;&#1080;&#1089;&#1083;&#1086; "&#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093;"): &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1072;&#1094;&#1080;&#1080; TEI (&#1048;&#1085;&#1080;&#1094;&#1080;&#1072;&#1090;&#1080;&#1074;&#1072; &#1050;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; &#1058;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;) [6].
                                      &#1044;&#1086;&#1083;&#1075;&#1080;&#1077; &#1075;&#1086;&#1076;&#1099; &#1077;&#1075;&#1086; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; &#1074;&#1086;&#1079;&#1075;&#1083;&#1072;&#1074;&#1083;&#1103;&#1083; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1080;&#1079; &#1072;&#1074;&#1090;&#1086;&#1088;&#1086;&#1074; XML&#1072; - &#1052;&#1072;&#1081;&#1082;&#1083;
                                      &#1057;&#1087;&#1077;&#1088;&#1073;&#1077;&#1088;&#1075;-&#1052;&#1072;&#1082;&#1082;&#1091;&#1080;&#1085; [59]. &#1071;&#1089;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1085;&#1072;&#1076;&#1086; &#1080;&#1084; &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;.
               </p>
                               
               <p>(&#1057; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099;, &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1073;&#1099; &#1087;&#1086;&#1085;&#1103;&#1090;&#1100;, &#1087;&#1086;&#1095;&#1077;&#1084;&#1091; &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1080;&#1084; &#1085;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1080;&#1083;&#1080;
                                      &#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1083;&#1080;&#1096;&#1100; &#1095;&#1072;&#1089;&#1090;&#1080;&#1095;&#1085;&#1086;: Theological Markup Language [60], TanakhML [61], Open
                                      Scripture [62], Project Gutenberg [63].)
               </p>
                           
            </div>
                        
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d5e422"></a>&#1054;&#1089;&#1086;&#1073;&#1099;&#1077; &#1073;&#1091;&#1082;&#1074;&#1099;
                        </h4>
                     </div>
                  </div>
               </div>
                               
                               
               <p>&#1042; &#1085;&#1072;&#1096;&#1080;&#1093; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;&#1093; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1086;&#1089;&#1086;&#1073;&#1099;&#1077; &#1073;&#1091;&#1082;&#1074;&#1099; (&#1056;&#1072;&#1079;&#1076;&#1077;&#1083; 2.1). &#1042; TEI &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1072;&#1084;&#1080;
                                      &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; &#1086;&#1089;&#1086;&#1073;&#1099;&#1093; &#1073;&#1091;&#1082;&#1074; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1083;&#1072;&#1089;&#1100; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1088;&#1072;&#1073;&#1086;&#1095;&#1072;&#1103; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072; [7]. &#1048;&#1084; &#1087;&#1086;&#1089;&#1074;&#1103;&#1097;&#1077;&#1085;&#1072;
                                      &#1075;&#1083;&#1072;&#1074;&#1072; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1072;&#1094;&#1080;&#1081; [9].
               </p>
                           
            </div>
                        
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d5e425"></a>&#1040;&#1085;&#1085;&#1086;&#1090;&#1072;&#1094;&#1080;&#1080;
                        </h4>
                     </div>
                  </div>
               </div>
                               
                               
               <p>&#1040;&#1085;&#1085;&#1086;&#1090;&#1072;&#1094;&#1080;&#1080; - &#1084;&#1077;&#1089;&#1090;&#1086;, &#1080;&#1084;&#1103; ... - &#1074; TEI &#1077;&#1089;&#1090;&#1100;.</p>
                           
            </div>
                        
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d5e428"></a>&#1055;&#1077;&#1088;&#1077;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1077;&#1089;&#1103; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1099;
                        </h4>
                     </div>
                  </div>
               </div>
                               
                               
               <p>&#1053;&#1072;&#1096;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1077;&#1088;&#1077;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1093;&#1089;&#1103; &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;
                                      (&#1056;&#1072;&#1079;&#1076;&#1077;&#1083; 2.3). &#1055;&#1088;&#1080;&#1095;&#1077;&#1084; &#1101;&#1090;&#1086; &#1082;&#1072;&#1089;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1058;&#1072;&#1085;&#1072;&#1093;&#1072; &#1080;&#1083;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074; &#1089; &#1084;&#1085;&#1086;&#1075;&#1080;&#1084;&#1080;
                                      &#1080;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103;&#1084;&#1080; &#1080; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;&#1084;&#1080; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;. &#1054;&#1076;&#1080;&#1085; &#1080;&#1079; &#1092;&#1091;&#1085;&#1076;&#1072;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;
                                      &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1091;&#1084;&#1077;&#1090;&#1100; &#1086;&#1090;&#1074;&#1077;&#1095;&#1072;&#1090;&#1100; &#1085;&#1072;&#1096;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1077;, &#1101;&#1090;&#1086; "&#1082;&#1072;&#1082;&#1080;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1099; &#1089;&#1089;&#1099;&#1083;&#1072;&#1102;&#1090;&#1089;&#1103; &#1085;&#1072;
                                      &#1076;&#1072;&#1085;&#1085;&#1099;&#1081;". &#1054;&#1090;&#1074;&#1077;&#1090; &#1085;&#1072; &#1090;&#1072;&#1082;&#1086;&#1081; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089; &#1074;&#1080;&#1076;&#1080;&#1090;&#1089;&#1103; &#1084;&#1085;&#1077; &#1082;&#1072;&#1082; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1091;&#1102;&#1097;&#1080;&#1081; &#1085;&#1072;&#1089; &#1090;&#1077;&#1082;&#1089;&#1090; &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081;
                                      &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099; "&#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1099;&#1077;" &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1072; &#1090;&#1077;&#1082;&#1089;&#1090;&#1099;, &#1085;&#1072; &#1085;&#1077;&#1075;&#1086; &#1089;&#1089;&#1099;&#1083;&#1072;&#1102;&#1097;&#1080;&#1077;&#1089;&#1103;. &#1053;&#1086; "&#1082;&#1086;&#1085;&#1094;&#1099;" &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; -
                                      &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1089;&#1090;&#1072;&#1083;&#1080; "&#1085;&#1072;&#1095;&#1072;&#1083;&#1072;&#1084;&#1080;" &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1099;&#1093; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; - &#1101;&#1090;&#1086; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1099; &#1085;&#1072;&#1096;&#1077;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;, &#1080;
                                      &#1086;&#1085;&#1080; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1084;&#1086;&#1075;&#1091;&#1090; &#1087;&#1077;&#1088;&#1077;&#1082;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;.
               </p>
                               
               <p>&#1050;&#1072;&#1082;&#1086;&#1077;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1081; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1080;&#1076;&#1091;&#1084;&#1072;&#1090;&#1100; &#1085;&#1077; &#1089;&#1093;&#1086;&#1076;&#1103; &#1089; &#1084;&#1077;&#1089;&#1090;&#1072;. &#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;,
                                      &#1076;&#1072;&#1078;&#1077; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086;. &#1053;&#1086; &#1087;&#1088;&#1086;&#1076;&#1091;&#1084;&#1072;&#1090;&#1100; &#1080;&#1093; &#1074;&#1086; &#1074;&#1089;&#1077;&#1093; &#1076;&#1077;&#1090;&#1072;&#1083;&#1103;&#1093;, &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1077;,
                                      &#1089;&#1088;&#1072;&#1074;&#1085;&#1080;&#1090;&#1100; &#1080; &#1090;.&#1076;. &#1079;&#1072;&#1081;&#1084;&#1105;&#1090; &#1075;&#1086;&#1076;&#1099;. &#1051;&#1102;&#1076;&#1080;, &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1102;&#1097;&#1080;&#1077;&#1089;&#1103; TEI [6], &#1080;&#1093; &#1091;&#1078;&#1077; &#1087;&#1086;&#1090;&#1088;&#1072;&#1090;&#1080;&#1083;&#1080;,
                                      &#1091;&#1076;&#1077;&#1083;&#1080;&#1083;&#1080; &#1101;&#1090;&#1086;&#1084;&#1091; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1091; &#1075;&#1083;&#1072;&#1074;&#1091; &#1056;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1072;&#1094;&#1080;&#1081; [10], &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1086;&#1074;&#1072;&#1083;&#1080; &#1088;&#1072;&#1073;&#1086;&#1095;&#1091;&#1102; &#1075;&#1088;&#1091;&#1087;&#1087;&#1091; [8],
                                      &#1080; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1072;&#1102;&#1090; &#1090;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100;: [13] [14] [15] [16] [17] .
               </p>
                           
            </div>
                        
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d5e432"></a>&#1057;&#1087;&#1088;&#1072;&#1074;&#1072; &#1085;&#1072; &#1083;&#1077;&#1074;&#1086; XXX &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1085;&#1099;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;?
                        </h4>
                     </div>
                  </div>
               </div>
                               
                               
               <p>&#1053;&#1072;&#1096;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090;&#1099; &#1087;&#1080;&#1096;&#1091;&#1090;&#1089;&#1103; &#1074; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1084; &#1085;&#1072; &#1080;&#1074;&#1088;&#1080;&#1090;&#1077;, &#1072;&#1088;&#1072;&#1084;&#1077;&#1081;&#1089;&#1082;&#1086;&#1084; &#1080; &#1080;&#1076;&#1080;&#1096;&#1077; - &#1089;&#1087;&#1088;&#1072;&#1074;&#1072; &#1085;&#1072; &#1083;&#1077;&#1074;&#1086;
                                      (&#1056;&#1072;&#1079;&#1076;&#1077;&#1083; 2.1). &#1058;&#1072;&#1075;&#1080; TEI (&#1080; &#1074;&#1089;&#1077;&#1093; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;&#1093; &#1084;&#1085;&#1077; XML-&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1086;&#1074;) &#1087;&#1080;&#1096;&#1091;&#1090;&#1089;&#1103; &#1087;&#1086;-&#1072;&#1085;&#1075;&#1083;&#1080;&#1081;&#1089;&#1082;&#1080;
                                      &#1080;, &#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;, &#1089;&#1083;&#1077;&#1074;&#1072; &#1085;&#1072; &#1087;&#1088;&#1072;&#1074;&#1086;. &#1061;&#1086;&#1088;&#1086;&#1096;&#1086; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1086; &#1082;&#1072;&#1082; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1076;&#1074;&#1091;&#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081;
                                      &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1074; XHTML&#1077; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1089;&#1077; &#1096;&#1083;&#1086; &#1074; &#1085;&#1091;&#1078;&#1085;&#1091;&#1102; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1091;, &#1080; &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1085;&#1077;
                                      &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100; &#1085;&#1077;&#1074;&#1080;&#1076;&#1080;&#1084;&#1099;&#1077; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1099; Unicod&#1072;, &#1084;&#1077;&#1085;&#1103;&#1102;&#1097;&#1080;&#1077; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; [54]. &#1053;&#1072;&#1084;,
                                      &#1086;&#1076;&#1085;&#1072;&#1082;&#1086;, &#1085;&#1072;&#1076;&#1086; &#1086;&#1073;&#1083;&#1077;&#1075;&#1095;&#1080;&#1090;&#1100; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1085;&#1072;&#1096;&#1080;&#1093; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074; &#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1084; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1077;
                                      (&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1102;&#1097;&#1077;&#1084; XML). &#1045;&#1089;&#1083;&#1080; &#1090;&#1072;&#1075;&#1080; &#1087;&#1080;&#1096;&#1091;&#1090;&#1089;&#1103; &#1085;&#1077; &#1074; &#1090;&#1086;&#1084; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080;, &#1095;&#1090;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;,
                                      &#1090;&#1072;&#1082;&#1086;&#1077; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;, &#1085;&#1072; &#1084;&#1086;&#1081; &#1074;&#1079;&#1075;&#1083;&#1103;&#1076;, &#1085;&#1077;&#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;. &#1040; &#1073;&#1077;&#1079; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;
                                      &#1085;&#1077;&#1074;&#1080;&#1076;&#1080;&#1084;&#1099;&#1093; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; - &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;.
               </p>
                               
               <p>&#1059;&#1087;&#1088;&#1072;&#1078;&#1085;&#1077;&#1085;&#1080;&#1077;: &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1074;&#1072;&#1096; &#1083;&#1102;&#1073;&#1080;&#1084;&#1099;&#1081; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;, &#1074;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1090;&#1072;&#1075;&#1080; &#1087;&#1086;&#1089;&#1091;&#1082;&#1072; &lt;verse&gt;
                                      &#1080; &lt;/verse&gt;, &#1072; &#1087;&#1086;&#1090;&#1086;&#1084; &#1085;&#1072;&#1087;&#1077;&#1095;&#1072;&#1090;&#1072;&#1081;&#1090;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1085;&#1080;&#1084;&#1080; &#1087;&#1086;&#1089;&#1091;&#1082; &#1085;&#1072; &#1080;&#1074;&#1088;&#1080;&#1090;&#1077;. &#1053;&#1077; &#1089;&#1090;&#1086;&#1083;&#1082;&#1085;&#1091;&#1083;&#1080;&#1089;&#1100;
                                      &#1083;&#1080; &#1074;&#1099; &#1089; &#1085;&#1077;&#1086;&#1078;&#1080;&#1076;&#1072;&#1085;&#1085;&#1086;&#1089;&#1090;&#1103;&#1084;&#1080;? &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1085;&#1077; &#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1083;&#1080; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099;
                                      &#1074;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077; &#1087;&#1088;&#1086;&#1073;&#1077;&#1083; &#1088;&#1103;&#1076;&#1086;&#1084; &#1089; &#1091;&#1075;&#1083;&#1086;&#1074;&#1086;&#1081; &#1089;&#1082;&#1086;&#1073;&#1082;&#1086;&#1081; &#1086;&#1073;&#1088;&#1072;&#1084;&#1083;&#1103;&#1102;&#1097;&#1077;&#1081; &#1090;&#1072;&#1075;? &#1053;&#1077; &#1074;&#1074;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1083;&#1080; &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084;
                                      &#1089;&#1083;&#1086;&#1074;&#1072; &#1074; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;&#1084; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;? &#1050; &#1082;&#1072;&#1082;&#1086;&#1084;&#1091; &#1089;&#1083;&#1086;&#1074;&#1091; &#1087;&#1086;&#1089;&#1091;&#1082;&#1072; &#1073;&#1083;&#1080;&#1078;&#1077; &#1086;&#1090;&#1088;&#1082;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1090;&#1072;&#1075; - &#1082;
                                      &#1087;&#1077;&#1088;&#1074;&#1086;&#1084;&#1091; &#1080;&#1083;&#1080; &#1082; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1084;&#1091;?
               </p>
                               
               <p>&#1071; &#1085;&#1077; &#1091;&#1074;&#1077;&#1088;&#1077;&#1085;, &#1095;&#1090;&#1086; &#1077;&#1089;&#1083;&#1080; &#1089;&#1072;&#1084;&#1080; &#1090;&#1072;&#1075;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1085;&#1072; &#1080;&#1074;&#1088;&#1080;&#1090;&#1077;, &#1090;&#1086; &#1074;&#1089;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1074;&#1074;&#1086;&#1076;&#1072; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;
                                      &#1080;&#1089;&#1095;&#1077;&#1079;&#1085;&#1091;&#1090; - &#1085;&#1086; &#1103; &#1091;&#1074;&#1077;&#1088;&#1077;&#1085;, &#1095;&#1090;&#1086; &#1093;&#1091;&#1078;&#1077; &#1085;&#1077; &#1089;&#1090;&#1072;&#1085;&#1077;&#1090;. &#1045;&#1089;&#1090;&#1100; &#1077;&#1097;&#1105; &#1086;&#1076;&#1085;&#1072; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072; &#1093;&#1086;&#1090;&#1077;&#1090;&#1100;, &#1095;&#1090;&#1086;&#1073;&#1099;
                                      &#1090;&#1072;&#1075;&#1080; &#1073;&#1099;&#1083;&#1080; &#1085;&#1072; &#1080;&#1074;&#1088;&#1080;&#1090;&#1077;: &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1085;&#1072;&#1096;&#1080; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1080;&#1090;&#1077;&#1083;&#1080; &#1080; &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1080; &#1072;&#1085;&#1075;&#1083;&#1080;&#1081;&#1089;&#1082;&#1086;&#1075;&#1086; &#1085;&#1077; &#1079;&#1085;&#1072;&#1102;&#1090;, &#1080;
                                      &#1076;&#1072;&#1078;&#1077; &#1074; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1072;&#1093; &#1085;&#1072;&#1073;&#1086;&#1088;&#1072; &#1090;&#1072;&#1075;&#1086;&#1074; TEI &#1091;&#1079;&#1085;&#1072;&#1074;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1085;&#1077; &#1079;&#1072;&#1093;&#1086;&#1090;&#1103;&#1090; - &#1080; &#1103; &#1080;&#1093; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1102;. &#1041;&#1099;&#1083;&#1086;
                                      &#1073;&#1099; &#1085;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1083;&#1080;&#1096;&#1080;&#1090;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1089;&#1077;&#1088;&#1100;&#1105;&#1079;&#1085;&#1086;&#1081; &#1086;&#1073;&#1090;&#1072;&#1075;&#1086;&#1074;&#1082;&#1080; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1090;&#1077;&#1093;, &#1082;&#1090;&#1086; &#1085;&#1072; &#1085;&#1077;&#1105;
                                      &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1074;&#1089;&#1077;&#1093; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1077;&#1085;. &#1040; &#1089;&#1077;&#1088;&#1100;&#1105;&#1079;&#1085;&#1072;&#1103; &#1086;&#1073;&#1090;&#1072;&#1075;&#1086;&#1074;&#1082;&#1072; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1072; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1084;
                                      &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1077;: &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; &#1095;&#1072;&#1089;&#1090;&#1086; &#1101;&#1090;&#1086; &#1091;&#1076;&#1086;&#1073;&#1085;&#1077;&#1077;, &#1095;&#1077;&#1084; &#1074;&#1089;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1077;
                                      web-&#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1099;, &#1085;&#1086; &#1080; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; web-&#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;, &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; &#1074;&#1089;&#1077; &#1090;&#1072;&#1075;&#1080; TEI
                                      &#1085;&#1072;&#1084; &#1085;&#1077; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100;. &#1040; &#1074; &#1089;&#1077;&#1088;&#1100;&#1105;&#1079;&#1085;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1086;&#1095;&#1077;&#1085;&#1100; &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1080;&#1079; &#1085;&#1080;&#1093; &#1085;&#1091;&#1078;&#1085;&#1099;.
               </p>
                               
               <p>&#1050;&#1072;&#1079;&#1072;&#1083;&#1086;&#1089;&#1100; &#1073;&#1099;, &#1077;&#1089;&#1083;&#1080; &#1090;&#1072;&#1075;&#1080; &#1074; &#1085;&#1072;&#1096;&#1080;&#1093; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;&#1093; &#1073;&#1091;&#1076;&#1091;&#1090; &#1085;&#1072; &#1080;&#1074;&#1088;&#1080;&#1090;&#1077;, &#1090;&#1086; &#1101;&#1090;&#1086; &#1091;&#1078;&#1077; &#1085;&#1077; TEI? &#1053;&#1077;
                                      &#1090;&#1091;&#1090; &#1090;&#1086; &#1073;&#1099;&#1083;&#1086;! TEI&#1074;&#1094;&#1099; &#1085;&#1072;&#1095;&#1072;&#1083;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1085;&#1072;&#1076; &#1080;&#1085;&#1090;&#1077;&#1088;&#1085;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1077;&#1081;: &#1093;&#1086;&#1090;&#1103;&#1090; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1089;&#1074;&#1086;&#1102;
                                      &#1096;&#1090;&#1091;&#1082;&#1086;&#1074;&#1080;&#1085;&#1091; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086;&#1081; &#1085;&#1077;&#1072;&#1085;&#1075;&#1083;&#1086;&#1103;&#1079;&#1099;&#1095;&#1085;&#1099;&#1084; [11]. &#1042;&#1086;&#1086;&#1073;&#1097;&#1077;, &#1091; &#1085;&#1080;&#1093; &#1074; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; - P5 -
                                      &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1084;&#1086;&#1078;&#1077;&#1090; &#1072;&#1076;&#1072;&#1087;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1093;&#1077;&#1084;&#1091;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; ROMA [12],
                                      &#1085;&#1072; &#1089;&#1074;&#1086;&#1102; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1102;.
               </p>
                               
               <p>&#1042; &#1083;&#1102;&#1073;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090;&#1099; &#1074; TEI, &#1085;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1072;&#1090;&#1100; &#1080;&#1093; &#1074;
                                      &#1076;&#1088;&#1091;&#1075;&#1086;&#1084; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077;, &#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1080; &#1079;&#1072;&#1089;&#1086;&#1074;&#1099;&#1074;&#1072;&#1090;&#1100; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;. &#1052;&#1085;&#1086;&#1075;&#1080;&#1077; &#1090;&#1072;&#1082; &#1080; &#1076;&#1077;&#1083;&#1072;&#1102;&#1090;. &#1058;&#1072;&#1082; &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084;,
                                      &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074;&#1074;&#1077;&#1089;&#1090;&#1080; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1085;&#1099;&#1077; &#1090;&#1072;&#1075;&#1080;, &#1073;&#1086;&#1083;&#1077;&#1077; &#1091;&#1084;&#1077;&#1089;&#1090;&#1085;&#1099;&#1077; &#1074; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1093; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;&#1093;, &#1095;&#1077;&#1084;
                                      &#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; &#1086;&#1073;&#1097;&#1080;&#1077; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1085;&#1099;&#1077; &#1090;&#1072;&#1075;&#1080; TEI.
               </p>
                           
            </div>
                        
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d5e439"></a>&#1057;&#1089;&#1099;&#1083;&#1082;&#1080;
                        </h4>
                     </div>
                  </div>
               </div>
                               
                               
               <p>&#1053;&#1072;&#1080;&#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1077; &#1073;&#1077;&#1089;&#1087;&#1086;&#1082;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1091; &#1084;&#1077;&#1085;&#1103; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080;. &#1054;&#1085;&#1080; &#1074; TEI &#1084;&#1086;&#1075;&#1091;&#1090; &#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;&#1089;&#1103;
                                      &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1084;&#1086;&#1097;&#1085;&#1099;&#1084;&#1080; &#1080; &#1075;&#1080;&#1073;&#1082;&#1080;&#1084;&#1080;. &#1053;&#1072;&#1084;, &#1087;&#1086;&#1093;&#1086;&#1078;&#1077;, &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; XLink (XPointer?) [57] &#1085;&#1077;
                                      &#1087;&#1086;&#1076;&#1086;&#1081;&#1076;&#1105;&#1090;: &#1085;&#1072;&#1076;&#1086; &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1085;&#1072; Topic Maps [70] &#1080; RDF [71].
               </p>
                           
            </div>
                        
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d5e442"></a>&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1099; XML&#1072;
                        </h4>
                     </div>
                  </div>
               </div>
                               
                               
               <p>&#1053;&#1072;&#1096; web-&#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1090;&#1100; &#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; &#1089;&#1077;&#1088;&#1100;&#1105;&#1079;&#1085;&#1086;&#1077; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;
                                      &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1085;&#1072; XML. &#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1099; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; &#1088;&#1086;&#1076;&#1072; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;: JXHTMLEDIT [41]
                                      (&#1076;&#1083;&#1103; HTML&#1072;), Syntext Serna [42] (&#1082;&#1086;&#1084;&#1084;&#1077;&#1088;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081;). &#1054;&#1076;&#1085;&#1072;&#1082;&#1086;, &#1082;&#1072;&#1082; &#1085;&#1080; &#1082;&#1088;&#1091;&#1090;&#1080;, &#1072; &#1085;&#1072;&#1076;&#1086;
                                      &#1084;&#1086;&#1095;&#1100; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072;&#1096;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090;&#1099; (XML, TEI) &#1074; &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1077; &#1056;&#1072;&#1079;&#1076;&#1077;&#1083; 3.3
                                      &#1090;&#1086;&#1078;&#1077;. &#1071; &#1089;&#1083;&#1099;&#1096;&#1072;&#1083; &#1084;&#1085;&#1086;&#1075;&#1086; &#1093;&#1086;&#1088;&#1086;&#1096;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086; Stylus Studio [43] &#1080; ALTOVA xmlspy [44] - &#1086;&#1073;&#1072;
                                      &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; Windows. &#1045;&#1089;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1099;&#1093; &#1085;&#1072; Jav&#1077; - &#1080; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1097;&#1080;&#1093;
                                      &#1074;&#1077;&#1079;&#1076;&#1077;: oXygen [45], Exchanger XML [46], editix [47], Topologi [48]. &#1052;&#1085;&#1077; &#1080;&#1079; &#1085;&#1080;&#1093;
                                      &#1085;&#1072;&#1089;&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1087;&#1086;&#1085;&#1088;&#1072;&#1074;&#1080;&#1083;&#1089;&#1103; Oxygen, &#1095;&#1090;&#1086; &#1103; &#1077;&#1075;&#1086; &#1082;&#1091;&#1087;&#1080;&#1083;.
               </p>
                           
            </div>
                        
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d5e445"></a>&#1048;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;
                        </h4>
                     </div>
                  </div>
               </div>
                               
                               
               <p>{Browser} {Tabs}</p>
                               
               <p>&#1057;&#1077;&#1081;&#1095;&#1072;&#1089; &#1084;&#1086;&#1076;&#1077;&#1085; AJAX [49]. &#1071; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1077;&#1083; &#1073;&#1099; &#1077;&#1075;&#1086; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1090;&#1100; &#1087;&#1088;&#1080; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1072; &#1076;&#1083;&#1103;
                                      &#1076;&#1080;&#1085;&#1072;&#1084;&#1080;&#1079;&#1100;&#1084;&#1072; &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1082;&#1072;&#1082;&#1080;&#1084;&#1080;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1085;&#1077;&#1074;&#1080;&#1076;&#1080;&#1084;&#1099;&#1084;&#1080; Java&#1074;&#1089;&#1082;&#1080;&#1084;&#1080; &#1072;&#1087;&#1083;&#1077;&#1090;&#1072;&#1084;&#1080; [50]
                                      [51], &#1095;&#1090;&#1086; &#1083;&#1080;... &#1042;&#1086;&#1090; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1077;&#1081;&#1096;&#1072;&#1103; &#1079;&#1072;&#1084;&#1077;&#1090;&#1082;&#1072; [52] &#1086; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072;&#1093; &#1089; AJAX&#1086;&#1084;. &#1053;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1072;
                                      &#1086;&#1085;&#1072; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1086;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1099;&#1084;&#1080; &#1096;&#1090;&#1091;&#1082;&#1072;&#1084;&#1080; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090;&#1089;&#1103; &#1091;&#1078;&#1077; &#1083;&#1077;&#1090; 10.
               </p>
                           
            </div>
                    
         </div>
                 
         <div class="section">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="d5e449"></a>Technology
                     </h3>
                  </div>
               </div>
            </div>
                        
                        
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d5e451"></a>XML Databases
                        </h4>
                     </div>
                  </div>
               </div>
                               
                               
               <p>It is possible to store the texts as XML files in the file system and use XSLT
                                      (as implemented by Saxon) to select requested pieces and transform them into
                                      presentation form. Indeed, I'll have a copy of all the texts in simple XML files
                                      anyway, since I need to check the texts into a revision-control system.
               </p>
                               
               <p>It seems likely, though, that I'll need to store the texts (also) in an XML
                                      database. Here are some requirements that make me think so:
               </p>
                               
               <div class="itemizedlist">
                  <ul class="itemizedlist" style="list-style-type: disc; ">
                     <li class="listitem">
                                                
                        <p>Access parts of documents in response to a query</p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p>Fetch fragments of the documents referenced from a given one</p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p>Find documents referencing a given one (link reversal)</p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p>Full text search</p>
                                            
                     </li>
                  </ul>
               </div>
                               
               <p>Only first of these requirements can realistically be satisfied without some
                                      indexes. On the other hand, only first two are trivially satisfied by an XML
                                      database (like Exist). Integration between Lucene text indexing package and
                                      Exist needs to be looked into. As for link reversal, we'll probably have to
                                      write the indexer and accessor ourselves...
               </p>
                               
               <p>It is clear that a query language to be used is&nbsp;<a class="ulink" href="http://isbn.nu/0321180607" target="_top">XQuery</a>. It is a nice,
                                      functional, non-statically-typed language, that have recently acquired update
                                      and text search capabilities. (XXX)
               </p>
                               
               <p>TEI&#1074;&#1094;&#1099; &#1090;&#1086;&#1078;&#1077; &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1085;&#1099;, &#1095;&#1090;&#1086; &#1085;&#1072;&#1076;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; XML&#1100;&#1085;&#1099;&#1084;&#1080; &#1073;&#1072;&#1079;&#1072;&#1084;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; XQuery
                                      [18].
               </p>
                               
               <p>&#1048;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1086; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; XML&#1100;&#1085;&#1099;&#1093; &#1073;&#1072;&#1079;&#1072;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090;&nbsp;<a class="ulink" href="http://www.rpbourret.com/" target="_top">? Bourret</a>. &#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;
                                      &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1099;&#1077; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1076;&#1083;&#1103; XML&#1072;:
               </p>
                               
               <div class="itemizedlist">
                  <ul class="itemizedlist" style="list-style-type: disc; ">
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://exist-db.org/" target="_top">eXist</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://www.sleepycat.com/products/bdbxml.html" target="_top">Berkeley DB XML</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://modis.ispras.ru/sedna/index.htm" target="_top">Sedna</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://www.eecs.umich.edu/db/timber" target="_top">Timber</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://xqzone.marklogic.com/" target="_top">MarkLogic</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://lucene.apache.org/" target="_top">Lucene</a></p>
                                            
                     </li>
                  </ul>
               </div>
                           
            </div>
                        
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d5e489"></a>XQuery
                        </h4>
                     </div>
                  </div>
               </div>
                               
                               
               <p>Some use XQuery as the (almost) only implementation language for the
                                      application (e.g.,&nbsp;<a class="ulink" href="http://judaica.podval.org/moin/AtomicWiki" target="_top">AtomicWiki</a>). XQuery *is* a functional language. But XQuery does not
                                      have static typesystem or exception processing. I will use Java (or Scala) as my
                                      main implementation language, and XQJ to access XQuery/XSLT processors.
               </p>
                           
            </div>
                        
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d5e493"></a>XML and Java
                        </h4>
                     </div>
                  </div>
               </div>
                               
                               
               <p>There are APIs for</p>
                               
               <div class="itemizedlist">
                  <ul class="itemizedlist" style="list-style-type: disc; ">
                     <li class="listitem">
                                                
                        <p>parsing: javax.xml.parsers</p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p>XSLT: javax.xml.transform</p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p>XPath: javax.xml.xpath</p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p>XQuery (XQJ): java.xml.query</p>
                                            
                     </li>
                  </ul>
               </div>
                               
               <p>javax.xml.xpath only supports XPath version 1</p>
                               
               <p>It seems that I can do pipelines using XQJ.</p>
                           
            </div>
                        
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d5e507"></a>XML Pipelines
                        </h4>
                     </div>
                  </div>
               </div>
                               
                               
               <div class="itemizedlist">
                  <ul class="itemizedlist" style="list-style-type: disc; ">
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://cocoon.apache.org/" target="_top">Cocoon</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://moinmo.in/FeatureRequests/PipelineArchitecture" target="_top">Pipelines</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p>XProc</p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://fgeorges.blogspot.com/2008/10/poor-mans-calabash-integeration-into.html" target="_top">Calabash</a></p>
                                            
                     </li>
                  </ul>
               </div>
                               
               <p>&#1055;&#1086;&#1082;&#1072; &#1095;&#1090;&#1086; &#1103; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1080;&#1083; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1074;&#1077; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097; &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1085;&#1072; TEI:
                                      Versioning Machine&nbsp;<a class="ulink" href="http://mith2.umd.edu/products/ver-mach/" target="_top">Versioning Machine</a>&nbsp;&#1080;&nbsp;<a class="ulink" href="http://teipublisher.sourceforge.net/docs/index.php" target="_top">&lt;teiPublisher&gt;</a>. &#1054;&#1073;&#1077; &#1076;&#1077;&#1083;&#1072;&#1083;&#1080; &#1086;&#1076;&#1085;&#1080; &#1080; &#1090;&#1077; &#1078;&#1077; &#1083;&#1102;&#1076;&#1080; -&nbsp;<a class="ulink" href="http://www.greenstone.org/cgi-bin/library" target="_top">Susan
                                             Schreibman</a>&nbsp;&#1080; Amit Kumar, &#1080; &#1086;&#1073;&#1077; &#1079;&#1072;&#1075;&#1083;&#1086;&#1093;&#1083;&#1080;. &#1042;&#1090;&#1086;&#1088;&#1072;&#1103; &#1076;&#1072;&#1078;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083;&#1072;
                                      eXist.
               </p>
                               
               <p>&#1053;&#1072;&#1084; &#1085;&#1072;&#1076;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1072;&#1084; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;, &#1085;&#1086; &#1080; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1102; &#1077;&#1075;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;: &#1082;&#1090;&#1086;,
                                      &#1082;&#1086;&#1075;&#1076;&#1072; &#1080; &#1095;&#1090;&#1086;. &#1069;&#1090;&#1086; &#1076;&#1072;&#1105;&#1090; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;&#1089;&#1103; &#1082; &#1083;&#1102;&#1073;&#1086;&#1084;&#1091; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1102;, &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100;
                                      &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1102;, &#1079;&#1072;&#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1080; &#1090;.&#1076;. &#1044;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1072;&#1076;&#1086;
                                      &#1087;&#1088;&#1080;&#1088;&#1072;&#1089;&#1090;&#1080;&#1090;&#1100; &#1082; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1075;&#1086;&#1090;&#1086;&#1074;&#1091;&#1102; version control system (XXX &#1085;&#1077; &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1086;), &#1072;
                                      &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; -&nbsp;<a class="ulink" href="http://judaica.podval.org/moin/SubVersion" target="_top">SubVersion</a>? Hg?.
               </p>
                               
               <p>&#1050; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1091; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1095;&#1077;&#1088;&#1077;&#1079; &#1089;&#1077;&#1090;&#1077;&#1074;&#1099;&#1077; &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083;&#1099;, &#1072; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086;
                                      &#1095;&#1077;&#1088;&#1077;&#1079; web-&#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;. &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1085;&#1099;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1091; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1077;&#1085;
                                      &#1088;&#1072;&#1079;&#1085;&#1099;&#1081;: &#1095;&#1077;&#1088;&#1077;&#1079;
               </p>
                               
               <div class="itemizedlist">
                  <ul class="itemizedlist" style="list-style-type: disc; ">
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://www.webdav.org/" target="_top">WebDAV</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p>REST</p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://en.wikipedia.org/wiki/SOAP" target="_top">SOAP</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://en.wikipedia.org/wiki/XML-RPC" target="_top">XML-RPC</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://xmldb-org.sourceforge.net/" target="_top">XML:DB</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://en.wikipedia.org/wiki/RSS_%28file_format%29" target="_top">RSS</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://en.wikipedia.org/wiki/Atom_%28standard%29" target="_top">Atom</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p>SubVersion/Hg</p>
                        <div class="itemizedlist">
                           <ul class="itemizedlist" style="list-style-type: circle; ">
                              <li class="listitem">
                                                                     
                                 <p>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089;&#1072;&#1094;&#1080;&#1103; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; &#1080; &#1084;&#1077;&#1090;&#1086;&#1082;</p>
                                                                 
                              </li>
                              <li class="listitem">
                                                                     
                                 <p>&#1048;&#1084;&#1087;&#1086;&#1088;&#1090; (&#1061;&#1091;&#1084;&#1072;&#1096;) &#1080; &#1087;&#1088;&#1103;&#1084;&#1086;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; (&#1089;&#1082;&#1072;&#1085;&#1099;) &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1093;
                                                                            &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1086;&#1074;
                                 </p>
                                                                 
                              </li>
                              <li class="listitem">
                                                                     
                                 <p><a class="ulink" href="http://www.w3.org/2001/Annotea/" target="_top">Annotea</a></p>
                                                                 
                              </li>
                              <li class="listitem">
                                                                     
                                 <p>Collate/Anastasia</p>
                                                                 
                              </li>
                           </ul>
                        </div>
                                            
                     </li>
                  </ul>
               </div>
                           
            </div>
                        
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d5e561"></a>WebDAV
                        </h4>
                     </div>
                  </div>
               </div>
                               
                               
               <p></p>
                           
            </div>
                        
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d5e564"></a>XML and Wiki
                        </h4>
                     </div>
                  </div>
               </div>
                               
                               
               <div class="itemizedlist">
                  <ul class="itemizedlist" style="list-style-type: disc; ">
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://code.google.com/p/atomicwiki" target="_top">AtomicWiki</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://code.google.com/p/wikimodel" target="_top">WikiModel</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://wikimodel.sourceforge.net/" target="_top">WikiModel</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://moinmo.in/XmlWiki" target="_top">XmlWiki</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://www.usemod.com/cgi-bin/mb.pl?WikiXmlDtd" target="_top">WikiXmlDtd</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://doc-book.sourceforge.net/homepage" target="_top">DocBookWiki</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://www.cecc.com.au/cb_pages/publishing.php" target="_top">Single Source Publishing</a></p>
                                            
                     </li>
                  </ul>
               </div>
                           
            </div>
                        
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d5e588"></a>Java Content Reporitory
                        </h4>
                     </div>
                  </div>
               </div>
                               
                               
               <p>&#1044;&#1086;&#1073;&#1072;&#1074;&#1080;&#1074; &#1082; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1091; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; (&#1080; &#1082;&#1086;&#1077;-&#1095;&#1090;&#1086; &#1077;&#1097;&#1105; :)), &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1084; Content
                                      Repository System.
               </p>
                               
               <p>&#1045;&#1089;&#1090;&#1100; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090; &#1074; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1082; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1091; &#1080;&#1079; Jav&#1099;: JSR 170. &#1069;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100;
                                      &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1086; &#1076;&#1083;&#1103; &#1085;&#1072;&#1089; - &#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080; &#1085;&#1077; &#1073;&#1099;&#1090;&#1100;. &#1050;&#1089;&#1090;&#1072;&#1090;&#1080;, &#1074; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1072;
                                      &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1077; &#1091;&#1095;&#1072;&#1089;&#1090;&#1080;&#1077; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083; &#1056;&#1086;&#1081; &#1060;&#1080;&#1083;&#1076;&#1080;&#1085;&#1075;, &#1072;&#1074;&#1090;&#1086;&#1088; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1086;&#1081;&nbsp;<a class="ulink" href="http://www.ics.uci.edu/~fielding/pubs/dissertation/rest_arch_style.htm#sec_5_2_3" target="_top">&#1076;&#1080;&#1089;&#1089;&#1077;&#1088;&#1090;&#1072;&#1094;&#1080;&#1080;</a>&nbsp;&#1087;&#1088;&#1086;&nbsp;<a class="ulink" href="http://rest.blueoxen.net/cgi-bin/wiki.pl?FrontPage" target="_top">REST</a>&nbsp;&#1080; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1086;&#1088;&#1086;&#1074; &#1048;&#1085;&#1090;&#1077;&#1088;&#1085;&#1077;&#1090;&#1072; - &#1072; &#1074; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1080;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;, &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1086;&#1088;
                                      &#1074; &#1082;&#1086;&#1084;&#1087;&#1072;&#1085;&#1080;&#1080;&nbsp;<a class="ulink" href="http://www.day.com/site/en/index.html" target="_top">Day</a>,
                                      &#1087;&#1088;&#1086;&#1076;&#1072;&#1102;&#1097;&#1077;&#1081; &#1090;&#1072;&#1082;&#1086;&#1077; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1077; :). &#1045;&#1089;&#1090;&#1100; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1072;&#1103; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103;: Apache
                                      Jackrabbit.
               </p>
                               
               <p>How do I return XML documents as XQJ-valued properties? My stuff is going to
                                      be stored in XML database (or a bunch of files processed by Saxon). I can not
                                      present them as files (because they may not be) that need to be parsed
                                      (especially when they are already parsed and indexed). So my only (standard)
                                      choice to glue the low-level store to Java is XQJ.
               </p>
                               
               <p>How do I project one hierarchy on top of another in JCR? Let's say I store
                                      files with texts in the repository. I need to expose the result (both through
                                      WebDAV and locally) as a hierarchy where I can drill into the documents'
                                      hierarchical structure (chapter, paragraph etc). I will do it through XQuery
                                      (likely XPath, but running within XQuery engine). Also, there may be multiple
                                      such structures, and before drilling in I will need to turn main structure into
                                      an alternative one using XSLT. I'd like the *external* view to have the same JCR
                                      API.
               </p>
                               
               <div class="itemizedlist">
                  <ul class="itemizedlist" style="list-style-type: disc; ">
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://en.wikipedia.org/wiki/Content_repository_API_for_Java" target="_top">At Wikipedia</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://www.theserverside.com/tt/articles/article.tss?l=JCRPract" target="_top">A Practitioner's Perspective</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://jcp.org/en/jsr/detail?id=170" target="_top">JSR
                                                          170</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://www.onjava.com/pub/a/onjava/2006/10/04/what-is-java-content-repository.html" target="_top">What is Java Content Repository?</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://jcp.org/en/jsr/detail?id=283" target="_top">JSR
                                                          283</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://www.infoq.com/news/2007/07/java-content-repository-2" target="_top">Version 2</a></p>
                                            
                     </li>
                  </ul>
               </div>
                               
               <p>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;:</p>
                               
               <div class="itemizedlist">
                  <ul class="itemizedlist" style="list-style-type: disc; ">
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://jackrabbit.apache.org/index.html" target="_top">Apache
                                                              Jackrabbit</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://lenya.apache.org/" target="_top">Apache Lenya</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://incubator.apache.org/graffito/" target="_top">Apache
                                                              Graffito</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://www.opencms.org/opencms/en/" target="_top">OpenCMS</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://www.dspace.org/" target="_top">DSpace</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://www.fedora.info/" target="_top">Fedora</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://www.greenstone.org/cgi-bin/library" target="_top">Greenstone</a></p>
                                            
                     </li>
                  </ul>
               </div>
                           
            </div>
                        
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d5e639"></a>Content management Systems
                        </h4>
                     </div>
                  </div>
               </div>
                               
                               
               <div class="itemizedlist">
                  <ul class="itemizedlist" style="list-style-type: disc; ">
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://java-source.net/open-source/content-managment-systems" target="_top">A list</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://www.day.com/site/en/index.html" target="_top">http://www.day.com/site/en/index.html</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://www.outerthought.com/en/products/daisy" target="_top">Daisy</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://cocoondev.org/daisy" target="_top">Daisy</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://lenya.apache.org/" target="_top">Apache Lenya</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://forrest.apache.org/" target="_top">Apache
                                                          Forrest</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://incubator.apache.org/graffito" target="_top">Apache
                                                              Graffito</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://www.opencms.org/opencms/en" target="_top">OpenCMS</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://www.dspace.org/" target="_top">DSpace</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://www.alfresco.com/" target="_top">Alfresco</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://www.magnolia-cms.com/" target="_top">Magnolia</a></p>
                                            
                     </li>
                  </ul>
               </div>
                           
            </div>
                        
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d5e675"></a>XForms
                        </h4>
                     </div>
                  </div>
               </div>
                               
                               
               <div class="itemizedlist">
                  <ul class="itemizedlist" style="list-style-type: disc; ">
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://chiba.sourceforge.net/" target="_top">Chiba</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://www.orbeon.com/" target="_top">Orbeon Forms</a></p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p>Firefox Extension</p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://judaica.podval.org/moin/FormFaces" target="_top">FormFaces</a></p>
                                            
                     </li>
                  </ul>
               </div>
                               
               <p>Tagsoup</p>
                           
            </div>
                        
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d5e690"></a>URLs
                        </h4>
                     </div>
                  </div>
               </div>
                               
                               
               <p>XPointer in the URI, not in the fragment! No delimiters, just URI parts -
                                      which can be implicit (not "chapter=3", but "chapters/3", or just "3")! Editions
                                      in the URI ("Chumash/boston+toronto/Genesis")! Metadata ("about"), raw XML etc.
                                      - in the URI, not as query parameter ("Genesis/about", "chaters/1/raw")! More
                                      URI promotion: natural references ("Genesis/2:1", "Genesis 2:1")! Intervals
                                      ("Genesis/2:1-3")! Concatenation ("Genesis/2:1-3;5") probably shouldn't be done
                                      through URIs!
               </p>
                               
               <p>Books URIs:</p>
                               
               <p>/books/Tanach/editions/.../[parts/.../]books/.../[weeks/...]/chapters/.../verses/...</p>
                               
               <p>editions: a | a+b (side-by-side) | a-b (differences)</p>
                               
               <p>parts: Torah | Neviim | Ksuvim</p>
                               
               <p>books: Genesis | Ionah | ... (appropriate for part if present)</p>
                               
               <p>weeks: Genesis | Noah | ...</p>
                               
               <p>chapters: n | m-n</p>
                               
               <p>verses: n | m-n (can be present only if one chapter is selected)</p>
                               
               <p>Alternative names may be used.</p>
                               
               <p>URL may be truncated.</p>
                               
               <p>Parts of the URL may be implied - and need to be derived.</p>
                           
            </div>
                        
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d5e704"></a>Metadata
                        </h4>
                     </div>
                  </div>
               </div>
                               
                               
               <p>Metadata is used to:</p>
                               
               <div class="itemizedlist">
                  <ul class="itemizedlist" style="list-style-type: disc; ">
                     <li class="listitem">
                                                
                        <p>guide navigation</p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p>provide listings and names</p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p>create classifications (links)</p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p>stitch together data directories</p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p>store application-specific metadata</p>
                                            
                     </li>
                  </ul>
               </div>
                               
               <p>Some of the data in it has to be duplicated in the text document (for
                                      self-containment, *and* for non-position-based navigation).
               </p>
                               
               <p>We need to be able to handle things like "Chumash/books/Genesis/weeks" and
                                      "Chumash/weeks" with one metadata document...
               </p>
                               
               <p>Locators for the navigational steps can be: - subdirectory/file - element
                                      XPATH - milestone XPATH
               </p>
                               
               <p>1) I need to be able to provide a list of selectors (book name/ chapter #/
                                      verse# etc.) on any level.
               </p>
                               
               <p>2) A selector can have multiple names, which I do not want to duplicate (and
                                      maintain) in each edition of the text. So, selector names have to be part of the
                                      metadata.
               </p>
                               
               <p>3) A text can have multiple structures.They are important for the metadata
                                      also. Restructuring of the text is done by XSLT. It seems logical to use the
                                      same for the restructuring of the metadata.
               </p>
               
                               
               <p>It follows that the metadata needs to be processable as XML (and have format
                                      similar to the texts). Do I also need it to be processable (in part) as Java
                                      objects (using JAXB) - is not clear.
               </p>
                               
               <p>We are going to use milestones [?] to represent multiple structures.</p>
                               
               <p>&lt;book n="Genesis"&gt;</p>
                               
               <p>&nbsp;&nbsp; &nbsp;&lt;chapter n="1"&gt;</p>
                               
               <p>&nbsp;&nbsp; &nbsp; &nbsp; &nbsp;&lt;week n="Genesis" milestone="begin"/&gt;</p>
                               
               <p>&nbsp;&nbsp; &nbsp; &nbsp; &nbsp;&lt;paragraph type="open" milestone="begin"/&gt;</p>
                               
               <p>&nbsp;&nbsp; &nbsp; &nbsp; &nbsp;&lt;verse n="1"&gt;</p>
                               
               <p>&nbsp;&nbsp; &nbsp; &nbsp; &nbsp;....</p>
                               
               <p>&nbsp;&nbsp; &nbsp; &nbsp; &nbsp;&lt;/verse&gt;</p>
                               
               <p>&nbsp;&nbsp; &nbsp;&lt;/chapter&gt;</p>
                               
               <p>&nbsp;&nbsp; &nbsp;...</p>
                               
               <p>&nbsp;&nbsp; &nbsp;&lt;chapter n="6"&gt;</p>
                               
               <p>&nbsp;&nbsp; &nbsp; &nbsp; &nbsp;&lt;verse n="1"&gt;</p>
                               
               <p>&nbsp;&nbsp; &nbsp; &nbsp; &nbsp;...</p>
                               
               <p>&nbsp;&nbsp; &nbsp; &nbsp; &nbsp;&lt;week n="Noach" milestone="begin"/&gt;</p>
                               
               <p>&nbsp;&nbsp; &nbsp; &nbsp; &nbsp;&lt;verse n=".."&gt;</p>
                               
               <p>&nbsp;&nbsp; &nbsp; &nbsp; &nbsp;...</p>
                               
               <p>&nbsp;&nbsp; &nbsp;&lt;/chapter&gt;</p>
                               
               <p>&lt;/book&gt;</p>
                           
            </div>
                        
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d5e743"></a>Tanach Markup
                        </h4>
                     </div>
                  </div>
               </div>
                               
                               
               <p>What are the TEI-appropriate tags for Tanach?How do we represent the paragraph
                                      in the middle of the verse?
               </p>
                               
               <p>Super-Wiki</p>
                               
               <p>Wiki with multiple formats =&gt; function reversal (TEI-&gt;HTML; edit;
                                      back)...
               </p>
                               
               <p>Wiki page rename and links correction - if the wiki itself is in an XML
                                      database (like&nbsp;<a class="ulink" href="http://judaica.podval.org/moin/AtomicWiki" target="_top">AtomicWiki</a>) *with* our link-reversal index, wouldn't it be easier?
                                      History will be kept by the revision-control system...
               </p>
                               
               <p>Navigation:</p>
                               
               <div class="itemizedlist">
                  <ul class="itemizedlist" style="list-style-type: disc; ">
                     <li class="listitem">
                                                
                        <p>expand/contract viewport</p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p>move viewport</p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p>switch to a different structure preserving focus (from "lesson" to
                                                       "chapter" in Tanya, for instance)
                        </p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p>switch to a different edition / look around at editions</p>
                                            
                     </li>
                  </ul>
               </div>
                           
            </div>
                        
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d5e760"></a>Internal Wiki Markup
                        </h4>
                     </div>
                  </div>
               </div>
                               
                               
               <p>&lt;section level="" milestone=""/&gt; 1 2 3 4 start</p>
                               
               <p>&lt;list type=""&gt; bullets numbers</p>
                               
               <div class="itemizedlist">
                  <ul class="itemizedlist" style="list-style-type: disc; ">
                     <li class="listitem">
                                                
                        <p>&lt;item&gt;</p>
                                            
                     </li>
                  </ul>
               </div>
                               
               <p>&lt;table&gt;</p>
                               
               <div class="itemizedlist">
                  <ul class="itemizedlist" style="list-style-type: disc; ">
                     <li class="listitem">
                                                
                        <p>&lt;row&gt;</p>
                                                
                        <div class="itemizedlist">
                           <ul class="itemizedlist" style="list-style-type: circle; ">
                              <li class="listitem">
                                                                 
                                 <p>&lt;item&gt;</p>
                                                             
                              </li>
                           </ul>
                        </div>
                                            
                     </li>
                  </ul>
               </div>
                               
               <p>&lt;paragraph&gt;</p>
                               
               <p>&lt;blockquote&gt;</p>
                               
               <p>&lt;line&gt;</p>
                               
               <p>&lt;style type=""&gt; emphasize bold italics underline strikethrough</p>
                               
               <p>&lt;anchor id=""&gt;</p>
                               
               <p>&lt;wikiLink relative="" reference=""&gt;</p>
                               
               <p>&lt;interWikiLink name="" refererence=""&gt;</p>
                               
               <p>&lt;urlLink reference=""&gt;</p>
                               
               <p>&lt;include&gt; image?</p>
                           
            </div>
                        
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d5e783"></a>Notes
                        </h4>
                     </div>
                  </div>
               </div>
                               
                               
               <p><a class="ulink" href="http://comments.gmane.org/gmane.text.tei.general/7031" target="_top">crowd-sourcing TEI files</a></p>
                               
               <p>Web-based IDE with WebDAV's versioning</p>
                           
            </div>
                        
            <div class="section">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="d5e788"></a>BUGS
                        </h4>
                     </div>
                  </div>
               </div>
                               
                               
               <p>Upstream:</p>
                               
               <div class="itemizedlist">
                  <ul class="itemizedlist" style="list-style-type: disc; ">
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://sourceforge.net/tracker/index.php?func=detail&amp;aid=2056090&amp;group_id=17691&amp;atid=117691" target="_top">http://sourceforge.net/tracker/index.php?func=detail&amp;aid=2056090&amp;group_id=17691&amp;atid=117691</a>&nbsp;exist
                                                       resolve-url
                        </p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p><a class="ulink" href="http://xmlroff.org/ticket/131" target="_top">http://xmlroff.org/ticket/131</a>&nbsp;xmlroff tables (fixed)
                        </p>
                                            
                     </li>
                  </ul>
               </div>
                               
               <p>Sebastian:</p>
                               
               <div class="itemizedlist">
                  <ul class="itemizedlist" style="list-style-type: disc; ">
                     <li class="listitem">
                                                
                        <p>File a bug against FO stylesheets (title, table of contents).</p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p>File a bug about reference shape consistency.</p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p>File a bug about use of @name for reference.</p>
                                            
                     </li>
                  </ul>
               </div>
                               
               <p>Saxon, Tomcat and relative URIs for the stylesheets. XQuery Server Pages (and
                                      eXist).
               </p>
                               
               <p>space before a word that has read/write annotations (Psalm 60)</p>
                               
               <p>Styles of biblio references.</p>
                               
               <p>Google SSO. GData. RSS/Atom - second edition? Hacking...?</p>
                               
               <p>Start working on XSLT: Genesis -&gt; FO</p>
                               
               <p>leningrad-import:</p>
                               
               <div class="itemizedlist">
                  <ul class="itemizedlist" style="list-style-type: disc; ">
                     <li class="listitem">
                                                
                        <p>remove stylesheet link</p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p>add TEI P5 All declaration; namespace(s)</p>
                                            
                     </li>
                     <li class="listitem">
                                                
                        <p>makaf</p>
                                            
                     </li>
                  </ul>
               </div>
                               
               <p>XProc</p>
                               
               <p>Discussions as text.</p>
                               
               <p>Convince CiteULike to make their XHTML really XHTML, or at least - well-formed
                                      XML. Better - parse RIS.
               </p>
                           
            </div>
                    
         </div>
         
             
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="dream.html">Prev</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="laying-out.html">Next</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">What do we want? (The Dream)&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td>
               <td width="40%" align="right" valign="top">&nbsp;Laying out classic Jewish texts</td>
            </tr>
         </table>
      </div>
   </body>
</html>