<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
   
      <title>2.&nbsp;New Year corrections</title>
      <link rel="stylesheet" type="text/css" href="css/docBook.css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.79.1">
      <link rel="home" href="index.html" title="Rambam on Calendar">
      <link rel="up" href="index.html" title="Rambam on Calendar">
      <link rel="prev" href="introduction.html" title="1.&nbsp;Introduction">
      <link rel="next" href="solar-theory.html" title="3.&nbsp;Solar Theory"><script type="text/javascript">
      window.MathJax = {
"MathML":{

},
"HTML-CSS":{

},
"extensions":["tex2jax.js", "mml2jax.js", "asciimath2jax.js", "MathMenu.js", "MathZoom.js"],
"PreviewHTML":{

},
"jax":["input/TeX", "input/AsciiMath", "input/MathML", "output/CommonHTML", "output/HTML-CSS", "output/NativeMML", "output/SVG"],
"SVG":{
"font":"TeX"
},
"AsciiMath":{

},
"TeX":{
"extensions":["AMSmath.js", "AMSsymbols.js", "noErrors.js", "noUndefined.js"]
},
"asciimath2jax":{
"delimiters":[["`", "`"]]
},
"mml2jax":{

},
"PlainSource":{

},
"NativeMML":{

},
"CommonHTML":{

},
"tex2jax":{
"processEscapes":true,
"inlineMath":[["$", "$"]],
"displayMath":[["$$", "$$"]]
}
};
    </script><script type="text/javascript" src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=MML_HTMLorMML"></script></head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">2.&nbsp;New Year corrections</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="introduction.html">Prev</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="solar-theory.html">Next</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter">
         <div class="titlepage">
            <div>
               <div>
                  <h1 class="title"><a name="new-year-corrections"></a>2.&nbsp;New Year corrections
                  </h1>
               </div>
            </div>
         </div>
         <div class="itemizedlist">
            <ul class="itemizedlist" style="list-style-type: disc; ">
               <li class="listitem">
                  <p>are there meaningful names for the corrections?</p>
               </li>
               <li class="listitem">
                  <p>are corrections explained by the desire to not have Yom Kippur on Sunday etc.?</p>
               </li>
               <li class="listitem">
                  <p>calculate third correction from the maximum length of a year and the first correction</p>
               </li>
               <li class="listitem">
                  <p>KH 7:8 says that postponement of RoshHaShonoh is done to align the calendar better
                           with the true molad; analyze the statistics of distances between mean and true molad
                           and RoshHashono.
                  </p>
               </li>
            </ul>
         </div>
         <p>There is an <a class="ulink" href="https://he.wikipedia.org/wiki/%D7%9E%D7%97%D7%9C%D7%95%D7%A7%D7%AA_%D7%A8%D7%91_%D7%A1%D7%A2%D7%93%D7%99%D7%94_%D7%92%D7%90%D7%95%D7%9F_%D7%95%D7%91%D7%9F_%D7%9E%D7%90%D7%99%D7%A8" target="_top">
                   argument</a> concerning some of the Rosh Hashono delays involving r. Saadia Gaon:
            
                &#1057;&#1087;&#1086;&#1088; &#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;&#1093; "&#1089;&#1090;&#1072;&#1088;&#1086;&#1075;&#1086; &#1084;&#1086;&#1083;&#1072;&#1076;&#1072;", &#1082;&#1086;&#1075;&#1076;&#1072; &#1086;&#1085; &#1086;&#1090;&#1086;&#1076;&#1074;&#1080;&#1075;&#1072;&#1077;&#1090; &#1056;&#1086;&#1096; &#1072;&#1096;&#1072;&#1085;&#1072; &#1085;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1076;&#1077;&#1085;&#1100;.
                &#1055;&#1086; &#1085;&#1072;&#1096;&#1077;&#1081; &#1096;&#1080;&#1090;&#1077; &#1086;&#1090; &#1056;&#1072;&#1089;&#1072;&#1075;&#1072; &#1080; &#1076;&#1072;&#1083;&#1100;&#1096;&#1077; - 18 &#1095;&#1072;&#1089;&#1086;&#1074;
                &#1055;&#1086; &#1096;&#1080;&#1090;&#1077; &#1040;&#1072;&#1088;&#1086;&#1085;&#1072; &#1041;&#1077;&#1085; &#1052;&#1077;&#1080;&#1088;&#1072; - 18 &#1095;&#1072;&#1089;&#1086;&#1074; &#1080; 642/1080 &#1095;&#1072;&#1089;&#1090;&#1077;&#1081; &#1095;&#1072;&#1089;&#1072;
         </p>
         <p>make possible calculating the calendar according to the other opinion and compare the results.</p>
         <p>&#1052;&#1086;&#1083;&#1072;&#1076; &#1075;&#1086;&#1076;&#1072; &#1090;&#1074;&#1086;&#1088;&#1077;&#1085;&#1080;&#1103; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1072; &#1074;&#1099;&#1093;&#1086;&#1076;&#1080;&#1090; &#1074; &#1087;&#1103;&#1090;&#1085;&#1080;&#1094;&#1091;.
                &#1069;&#1090;&#1086; &#1080; &#1073;&#1099;&#1083;&#1086; &#1056;&#1086;&#1096; &#1072;-&#1064;&#1072;&#1085;&#1072; &#1074;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1075;&#1086;&#1076;&#1072;, &#1074;&#1077;&#1076;&#1100; &#1090;&#1086;&#1075;&#1076;&#1072; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087; &#1083;&#1080; &#1072;&#1076;&#1091; &#1056;&#1086;&#1096; &#1085;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1083;&#1089;&#1103;.
                &#1058;&#1086;&#1075;&#1076;&#1072; &#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1077;&#1081; &#1089;&#1087;&#1086;&#1088; &#1056;&#1072;&#1084;&#1073;&#1072;&#1084;&#1072; &#1080; &#1056;&#1072;&#1081;&#1074;&#1072;&#1076;&#1072; &#1086; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1077; &#1089;&#1076;&#1074;&#1080;&#1075;&#1072; &#1056;&#1086;&#1096; &#1072;-&#1064;&#1072;&#1085;&#1072; &#1083;&#1086; &#1072;&#1076;&#1091;.
                &#1056;&#1072;&#1084;&#1073;&#1072;&#1084;&#1072; &#1085;&#1072;&#1089;&#1090;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; &#1076;&#1083;&#1103; &#1087;&#1086;&#1076;&#1089;&#1095;&#1105;&#1090;&#1072; &#1087;&#1086; &#1082;&#1080;&#1073;&#1091;&#1094; &#1101;&#1084;&#1094;&#1072;&#1080;,
                &#1072; &#1056;&#1072;&#1081;&#1074;&#1072;&#1076; &#1085;&#1072; &#1085;&#1077;&#1075;&#1086; &#1080;&#1079; &#1058;&#1072;&#1083;&#1084;&#1091;&#1076;&#1072; &#1074;&#1086;&#1079;&#1084;&#1091;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103;.
                &#1058;&#1077;&#1086;&#1088;&#1077;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1082;&#1072;&#1083;&#1077;&#1085;&#1076;&#1072;&#1088;&#1100; &#1085;&#1072; &#1074;&#1088;&#1077;&#1084;&#1103; &#1076;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1082;&#1072;&#1083;&#1077;&#1085;&#1076;&#1072;&#1088;&#1103; &#1073;&#1077;&#1079; &#1089;&#1076;&#1074;&#1080;&#1075;&#1072; &#1056;&#1086;&#1096; &#1072;-&#1064;&#1072;&#1085;&#1072;.
         </p>
         <p>Rav Ada's tkufos started a week later than Shmuel's! Isn't it readily observable?
                Analyze the difference in historic periods...
         </p>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="introduction.html">Prev</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="solar-theory.html">Next</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">1.&nbsp;Introduction&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td>
               <td width="40%" align="right" valign="top">&nbsp;3.&nbsp;Solar Theory</td>
            </tr>
         </table>
      </div>
   </body>
</html>