<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
   
      <title>Check statements of Nove Kadosh / Ibn Ezra</title>
      <link rel="stylesheet" type="text/css" href="css/docBook.css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.79.1">
      <link rel="home" href="index.html" title="Rambam on Calendar">
      <link rel="up" href="solar-theory.html" title="Solar Theory">
      <link rel="prev" href="interesting.html" title="Interesting">
      <link rel="next" href="lunar-theory.html" title="Lunar Theory"><script>MathJax = { "loader":{ "load":["input/asciimath"] }, "tex":{ "processEscapes":true,
  "inlineMath":[["$", "$"]], "displayMath":[["$$", "$$"]] } };</script><script type="text/javascript" id="MathJax-script" async="async" src="https://cdn.jsdelivr.net/npm/mathjax@3/es5/tex-mml-chtml.js"></script></head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">Check statements of Nove Kadosh / Ibn Ezra</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="interesting.html">Prev</a>&nbsp;
               </td>
               <th width="60%" align="center">Solar Theory</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="lunar-theory.html">Next</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="section">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="interesting2"></a>Check statements of Nove Kadosh / Ibn Ezra
                  </h2>
               </div>
            </div>
         </div>
         <p>
            TODO &#1054;&#1090; &#1050;&#1086;&#1088;&#1080;&#1094;&#1072;:
            
            &#1493;&#1491;&#1489;&#1512; &#1494;&#1492; &#1492;&#1500;&#1499;&#1492; &#1500;&#1502;&#1513;&#1492; &#1502;&#1505;&#1497;&#1504;&#1497; &#1492;&#1493;&#1488;, &#1513;&#1489;&#1494;&#1502;&#1503; &#1513;&#1497;&#1513; &#1505;&#1504;&#1492;&#1491;&#1512;&#1497;&#1503; &#1511;&#1493;&#1489;&#1506;&#1497;&#1503; &#1506;&#1500; &#1492;&#1512;&#1488;&#1497;&#1497;&#1492; &#1493;&#1489;&#1494;&#1502;&#1503; &#1513;&#1488;&#1497;&#1503; &#1513;&#1501; &#1505;&#1504;&#1492;&#1491;&#1512;&#1497;&#1503; &#1511;&#1493;&#1489;&#1506;&#1497;&#1503; &#1506;&#1500; &#1495;&#1513;&#1489;&#1493;&#1503; &#1494;&#1492; &#1513;&#1488;&#1504;&#1493; &#1502;&#1495;&#1513;&#1489;&#1497;&#1503; &#1489;&#1493; &#1492;&#1497;&#1493;&#1501;
            &#1493;&#1488;&#1497;&#1503; &#1504;&#1494;&#1511;&#1511;&#1497;&#1503; &#1500;&#1512;&#1488;&#1497;&#1497;&#1492;, &#1488;&#1500;&#1488; &#1508;&#1506;&#1502;&#1497;&#1501; &#1513;&#1497;&#1492;&#1497;&#1492; &#1497;&#1493;&#1501; &#1513;&#1511;&#1493;&#1489;&#1506;&#1497;&#1503; &#1489;&#1493; &#1489;&#1495;&#1513;&#1489;&#1493;&#1503; &#1494;&#1492; &#1492;&#1493;&#1488; &#1497;&#1493;&#1501; &#1492;&#1512;&#1488;&#1497;&#1497;&#1492; &#1488;&#1493; &#1511;&#1493;&#1491;&#1501; &#1500;&#1493; &#1489;&#1497;&#1493;&#1501; &#1488;&#1493; &#1488;&#1495;&#1512;&#1497;&#1493; &#1489;&#1497;&#1493;&#1501;, &#1493;&#1494;&#1492; &#1513;&#1497;&#1492;&#1497;&#1492; &#1488;&#1495;&#1512; &#1492;&#1512;&#1488;&#1497;&#1497;&#1492;
            &#1489;&#1497;&#1493;&#1501; &#1508;&#1500;&#1488; &#1492;&#1493;&#1488; &#1493;&#1489;&#1488;&#1512;&#1510;&#1493;&#1514; &#1513;&#1492;&#1503; &#1500;&#1502;&#1506;&#1512;&#1489; &#1488;&#1512;&#1509; &#1497;&#1513;&#1512;&#1488;&#1500;.
            
            &#1504;&#1488;&#1493;&#1492; &#1511;&#1493;&#1491;&#1513; &#1492;&#1500;&#1499;&#1493;&#1514; &#1511;&#1497;&#1491;&#1493;&#1513; &#1492;&#1495;&#1493;&#1491;&#1513; &#1508;&#1512;&#1511; &#1492; &#1492;&#1500;&#1499;&#1492; &#1489;
            &#1499;&#1489;&#1512; &#1504;&#1514;&#1489;&#1488;&#1512; &#1500;&#1506;&#1497;&#1500; &#1489;&#1508;&#1512;&#1511; &#1512;&#1488;&#1513;&#1493;&#1503; &#1492;&#1500;&#1499;&#1492; &#1490;' &#1506;"&#1508; &#1510;&#1497;&#1493;&#1512; &#1489;&#1488;&#1497;&#1494;&#1492; &#1488;&#1493;&#1508;&#1503; &#1513;&#1488;&#1508;&#1513;&#1512; &#1500;&#1492;&#1497;&#1493;&#1514; &#1511;&#1497;&#1489;&#1493;&#1509; &#1492;&#1488;&#1502;&#1514;&#1497; &#1511;&#1493;&#1491;&#1501; &#1500;&#1492;&#1488;&#1502;&#1510;&#1506;&#1497; &#1488;&#1493; &#1513;&#1497;&#1492;&#1497;&#1492; &#1488;&#1495;&#1512; &#1492;&#1488;&#1502;&#1510;&#1506;&#1497;, &#1493;&#1500;&#1508;&#1506;&#1502;&#1497;&#1501; &#1497;&#1492;&#1497;&#1493;
            &#1511;&#1497;&#1489;&#1493;&#1509; &#1492;&#1488;&#1502;&#1514;&#1497; &#1493;&#1492;&#1488;&#1502;&#1510;&#1506;&#1497; &#1489;&#1512;&#1490;&#1506; &#1488;&#1495;&#1491;, &#1493;&#1492;&#1511;&#1491;&#1497;&#1502;&#1492; &#1488;&#1493; &#1492;&#1488;&#1495;&#1497;&#1512;&#1492; &#1513;&#1500; &#1511;&#1497;&#1489;&#1493;&#1509; &#1492;&#1488;&#1502;&#1514;&#1497; &#1502;&#1492;&#1488;&#1502;&#1510;&#1506;&#1497; &#1500;&#1499;&#1500; &#1492;&#1497;&#1493;&#1514;&#1512; &#1492;&#1493;&#1488; &#1511;&#1512;&#1493;&#1489; &#1500;&#1497;"&#1491; &#1513;&#1506;&#1493;&#1514; &#1493;&#1499;&#1503; &#1491;&#1506;&#1514; &#1492;&#1512;' &#1488;&#1489;&#1512;&#1492;&#1501; &#1488;&#1489;&#1503;
            &#1506;&#1494;&#1512;&#1488; &#1489;&#1508;&#1512;&#1513;&#1514; &#1489;&#1488; &#1491;&#1492;&#1497;&#1497;&#1504;&#1493; &#1497;"&#1490; &#1513;&#1506;&#1493;&#1514; &#1493;&#1513;&#1500;&#1513;&#1492; &#1512;&#1489;&#1497;&#1506;&#1497;&#1493;&#1514; &#1513;&#1506;&#1492;, &#1493;&#1491;&#1493;&#1511;&#1488; &#1489;&#1514;&#1513;&#1512;&#1497; &#1488;&#1513;&#1512; &#1492;&#1493;&#1488; &#1489;&#1502;&#1488;&#1494;&#1504;&#1497;&#1501; &#1488;&#1494;&#1497; &#1488;&#1508;&#1513;&#1512; &#1513;&#1497;&#1511;&#1491;&#1497;&#1501; &#1492;&#1488;&#1502;&#1514;&#1497; &#1500;&#1492;&#1488;&#1502;&#1510;&#1506;&#1497; &#1513;&#1497;&#1506;&#1493;&#1512; &#1492;&#1504;&#1494;&#1499;&#1512; &#1488;&#1489;&#1500;
            &#1492;&#1488;&#1497;&#1495;&#1493;&#1512; &#1513;&#1500; &#1511;&#1497;&#1489;&#1493;&#1509; &#1492;&#1488;&#1502;&#1514;&#1497; &#1502;&#1492;&#1488;&#1502;&#1510;&#1506;&#1497; &#1489;&#1514;&#1513;&#1512;&#1497; &#1500;&#1488; &#1497;&#1492;&#1497;&#1492; &#1499;&#1497; &#1488;&#1501; &#1511;&#1512;&#1493;&#1489; &#1500;&#1513;&#1513; &#1513;&#1506;&#1493;&#1514; &#1493;&#1500;&#1488; &#1497;&#1493;&#1514;&#1512; &#1493;&#1489;&#1495;&#1491;&#1513; &#1504;&#1497;&#1505;&#1503; &#1488;&#1513;&#1512; &#1492;&#1493;&#1488; &#1489;&#1496;&#1500;&#1492; &#1497;&#1492;&#1497;&#1492; &#1492;&#1491;&#1497;&#1503; &#1489;&#1492;&#1508;&#1493;&#1498; &#1512;"&#1500; &#1500;&#1499;&#1500; &#1492;&#1497;&#1493;&#1514;&#1512;
            &#1500;&#1488; &#1514;&#1492;&#1497;&#1492; &#1492;&#1511;&#1491;&#1497;&#1502;&#1492; &#1492;&#1504;&#1494;&#1499;&#1512; &#1499;&#1497; &#1488;&#1501; &#1511;&#1512;&#1493;&#1489; &#1500;&#1513;&#1513; &#1513;&#1506;&#1493;&#1514;, &#1493;&#1492;&#1488;&#1497;&#1495;&#1493;&#1512; &#1497;&#1499;&#1493;&#1500; &#1500;&#1492;&#1497;&#1493;&#1514; &#1511;&#1512;&#1493;&#1489; &#1500;&#1497;"&#1491; &#1513;&#1506;&#1493;&#1514;, &#1499;&#1500; &#1494;&#1492; &#1497;&#1514;&#1489;&#1488;&#1512; &#1489;&#1506;"&#1492; &#1500;&#1511;&#1502;&#1503; &#1489;&#1491;&#1512;&#1498; &#1502;&#1493;&#1508;&#1514;, &#1493;&#1502;&#1489;&#1493;&#1488;&#1512; &#1513;&#1499;&#1500; &#1491;&#1489;&#1512;&#1497;
            &#1512;&#1489;&#1497;&#1504;&#1493; &#1513;&#1500; &#1492;&#1500;&#1499;&#1492; &#1494;&#1493; &#1492;&#1493;&#1500;&#1498; &#1493;&#1505;&#1493;&#1489;&#1489; &#1506;&#1500; &#1495;&#1491;&#1513; &#1514;&#1513;&#1512;&#1497; &#1488;&#1513;&#1512; &#1489;&#1493; &#1513;&#1497;&#1497;&#1498; &#1499;&#1500; &#1492;&#1491;&#1495;&#1497;&#1493;&#1514; &#1492;&#1502;&#1489;&#1493;&#1488;&#1512;&#1497;&#1501; &#1500;&#1511;&#1502;&#1503; &#1489;&#1508;&#1512;&#1511; &#1494;' &#1506;&#1497;&#1497;&#1503; &#1513;&#1501;,
            
            &#1053;&#1077; &#1079;&#1085;&#1072;&#1102;, &#1082;&#1090;&#1086; &#1101;&#1090;&#1086;; &#1085;&#1077; &#1074;&#1077;&#1088;&#1102;, &#1095;&#1090;&#1086; &#1089;&#1088;&#1077;&#1076;&#1085;&#1077;&#1074;&#1077;&#1082;&#1086;&#1074;&#1094;&#1099; &#1084;&#1086;&#1075;&#1083;&#1080; &#1076;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1090;&#1077;&#1086;&#1088;&#1077;&#1084;&#1091; &#1086; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1076;&#1080;&#1089;&#1090;&#1072;&#1085;&#1094;&#1080;&#1080;; &#1085;&#1086; &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; &#1101;&#1090;&#1080; &#1091;&#1090;&#1074;&#1077;&#1088;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;,
            &#1095;&#1100;&#1080; &#1073;&#1099; &#1086;&#1085;&#1080; &#1085;&#1080; &#1073;&#1099;&#1083;&#1080;, &#1085;&#1072;&#1076;&#1086; &#1089;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1095;&#1077;&#1088;&#1077;&#1079; 15 &#1084;&#1080;&#1085;&#1091;&#1090; &#1087;&#1086;&#1089;&#1083;&#1077; &#1079;&#1072;&#1093;&#1086;&#1076;&#1072;, &#1072; &#1074; &#1083;&#1102;&#1073;&#1086;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; :)
            
            &#1489;&#1497;&#1493;&#1490;&#1512;&#1508;&#1497;&#1492; - &#1504;&#1488;&#1493;&#1492; &#1511;&#1491;&#1513;
            &#1512;&#1489;&#1497; &#1513;&#1502;&#1506;&#1493;&#1503; &#1493;&#1493;&#1488;&#1500;&#1496;&#1513; &#1492;&#1497;&#1492; &#1502;&#1491;&#1512;&#1497; &#1492;&#1506;&#1497;&#1512; &#1489;&#1512;&#1493;&#1504;&#1513;&#1493;&#1493;&#1497;&#1490; &#1513;&#1489;&#1488;&#1513;&#1499;&#1504;&#1494;, &#1488;&#1514; &#1495;&#1499;&#1502;&#1514; &#1492;&#1514;&#1499;&#1493;&#1504;&#1492; &#1500;&#1502;&#1491; &#1502;&#1502;&#1497; &#1513;&#1504;&#1495;&#1513;&#1489; &#1489;&#1491;&#1493;&#1512;&#1493; (&#1513;&#1504;&#1493;&#1514; &#1492;&#1514;"&#1511;) &#1499;&#1488;&#1495;&#1491; &#1492;&#1502;&#1493;&#1502;&#1495;&#1497;&#1501; &#1492;&#1490;&#1491;&#1493;&#1500;&#1497;&#1501; &#1489;&#1495;&#1499;&#1502;&#1492;
            &#1494;&#1493;, &#1492;&#1499;&#1493;&#1504;&#1492; &#1500;&#1512;&#1489;&#1497; &#1497;&#1513;&#1499;&#1512; &#1489;&#1506;&#1512;&#1497;&#1513; &#1489;&#1504;&#1493; &#1513;&#1500; &#1492;&#1490;&#1488;&#1493;&#1503; &#1492;&#1490;&#1491;&#1493;&#1500; &#1512;&#1489;&#1497; &#1488;&#1512;&#1497;&#1492; &#1500;&#1497;&#1489; (&#1489;&#1503; &#1492;&#1508;&#1504;"&#1497;) &#1512;&#1489;&#1492; &#1492;&#1504;&#1493;&#1491;&#1506; &#1513;&#1500; &#1492;&#1504;&#1493;&#1489;&#1512;, &#1488;&#1513;&#1512; &#1492;&#1505;&#1499;&#1497;&#1501; &#1489;&#1492;&#1514;&#1500;&#1492;&#1489;&#1493;&#1514; &#1500;&#1508;&#1512;&#1505;&#1493;&#1501; &#1505;&#1508;&#1512; "&#1504;&#1488;&#1493;&#1492;
            &#1511;&#1493;&#1491;&#1513;", &#1489;&#1508;&#1512;&#1496; &#1500;&#1488;&#1495;&#1512; &#1513;&#1499;&#1489;&#1512; &#1504;&#1497;&#1514;&#1504;&#1492; &#1492;&#1505;&#1499;&#1502;&#1514;&#1493; &#1513;&#1500; &#1512;&#1489;&#1492; &#1492;&#1490;&#1491;&#1493;&#1500; &#1513;&#1500; &#1489;&#1512;&#1500;&#1497;&#1503; &#1512;&#1489;&#1497; &#1510;&#1489;&#1497; &#1492;&#1497;&#1512;&#1513; &#1500;&#1493;&#1497;&#1503;.
                  &#1505;&#1508;&#1512; "&#1504;&#1488;&#1493;&#1492; &#1511;&#1493;&#1491;&#1513;" &#1492;&#1493;&#1491;&#1508;&#1505; &#1489;&#1489;&#1512;&#1500;&#1497;&#1503; &#1489;&#1513;&#1504;&#1514; &#1514;&#1511;&#1502;"&#1493; (1786). 53 &#1491;&#1507;. &#1492;&#1505;&#1508;&#1512; &#1492;&#1493;&#1491;&#1508;&#1505; &#1513;&#1504;&#1497;&#1514; &#1489;&#1502;&#1492;&#1491;&#1493;&#1512;&#1514; &#1510;&#1497;&#1500;&#1493;&#1501; (&#1489;&#1514;&#1493;&#1498; &#1505;&#1508;&#1512; &#1508;&#1493;&#1506;&#1500; &#1492;' &#1495;"&#1489;) &#1489;&#1513;&#1504;&#1514; &#1514;&#1513;&#1499;"&#1496;
            (1969), &#1493;&#1513;&#1493;&#1489; &#1489;&#1489;&#1504;&#1497; &#1489;&#1512;&#1511; &#1489;&#1513;&#1504;&#1514; &#1514;&#1513;&#1504;"&#1495; (1998) (&#1489;&#1514;&#1493;&#1498; &#1505;&#1508;&#1512; &#1508;&#1493;&#1506;&#1500; &#1492;' &#1495;"&#1490;).
                  &#1492;&#1495;&#1497;&#1491;&#1493;&#1513;&#1497;&#1501; &#1506;&#1500; &#1492;&#1512;&#1502;&#1489;"&#1501; &#1492;&#1493;&#1499;&#1504;&#1505;&#1493; &#1502;&#1502;&#1492;&#1491;&#1493;&#1512;&#1514; &#1508;&#1512;&#1497;&#1491;&#1489;&#1512;&#1490; &#1497;&#1512;&#1493;&#1513;&#1500;&#1497;&#1501; &#1514;&#1513;&#1505;"&#1493;.
                
         </p>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="interesting.html">Prev</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="solar-theory.html">Up</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="lunar-theory.html">Next</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">Interesting&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td>
               <td width="40%" align="right" valign="top">&nbsp;Lunar Theory</td>
            </tr>
         </table>
      </div>
   </body>
</html>