package org.podval.calendar.generate.chumash

/*
Законы совпадений:
1. 6) отодвигается при любом сожертвоприношения
2. 2) 3) 4) совпадающие с шабатом - дополнительный свиток Торы
3. 2) и 3) дополнительный свиток , то есть если и 2. то три свитка Торы
4. В 7) Йом кипур отодвигает шабат.
Чтение в шени и хамиши отодвигаются любым обязательным чтением Торы, чтение в минху отодвигается в Йом кипур.

Меняющиеся тексты для чтения в зависимости от года
Распределение чтения на холь амоед Песах
1. Шабат хол амоед Суккот и Песах: Шмот, 33:12 - 34:26
2. Кадеш: Шмот, 13:1-16
3. Кесеф: Шмот, 22:24 -23:19
4. Псоль: Шмот, 34:1-26
5. Бемидбар: Бемидбар, 9:1-14
Когда первый день Песаха  в шабат, в первый или третий день недели: с 3 по 6 день Песаха
читают: 2. 3. 4. 5.
Когда первый день Песаха  в пятый день недели: с 3 по 6 день Песаха
читают: 2. 3. 1. 5.


Дополнительные чтения Торы - мафтир.
5. Когда на шабат выпадает рош ходеш или холь амоед - мафтир жертвоприношения.
6. В холь а-моед Песах - мафтир жертвоприношения.
7. Йом тов, Рош а-шана, Йом кипур - мафтир жертвоприношения.

Тексты жертвоприношений
Все дни жертвоприношений в Храме (кроме шабата, не совпавшего с рош ходеш) мы читаем стихи жертвоприношений (Бемидбар, 28-29)
Эти дни: рош ходеш, Рош ашана, Йом кипур, все праздничные у полупраздничные дни.
В диаспоре обязательное чтение в холь-амоед - двух дней, сегодняшнего и завтрашнего
Из них: в рош-ходеш и холь амоед Суккот жертвоприношения читают в основном чтении. При обязательное чтение должно быть завершением.
В остальные дни  - мафтир.
Рош ходеш - см. выше
Рош-шана, оба дня: Бемидбар, 27:1-6
Йом кипур - 7-11
Суккот первый день(в диаспоре - 2 дня) 12-16
2. 17-19
3. 20-22
4.23-25
5. 26-28
6. 29-31
7. 32-34
В будни холь амоеда -
В Земле Израиля первый читает сегодняшнее, второй - завтрашнее, третий - послезавтрашнее, четвертый  сегодняшнее.
В диаспоре -  первый - вчерашнее, второй - сегодняшее, третий - завтрашнее, четвертый-  вчерашнее и сегодняшнее.
Исключение - 6 день Суккот. Все читают первые три алийот как в диаспоре, но в четвертой - разница как описана выше.
Шмини ацерет ( и Симхат Тора) - 35-39
В Песах первый день ( в диаспоре и второй) Бемидбар, 28:16-25
Со второго по шестой день: 19-25
Седьмой ( и восьмой в диаспоре) день Песаха: 19-25
Шавуот: 26-31


Days without Tachanun
Рош ходеш
Йом тов
Хол- амоэд
Канун Рош ашана
Рош ашана
Канун Йом кипур
Йом кипур
Месяц тишрей с 11 числа
Ханука
Ту бишват
Пурим катан и Шушан Пурим катан
Пурим и Шушан Пурим (Пурим мешулаш также 16 адара)
Весь месяц нисан
Песах шени
Лаг баомер
С 1 до 12 сивана
Тиша беав
Ту биав
Все дни кроме Песах шени, кануна Рош ашана и кануна Йом кипура их канун в минху не говорят таханун.
В Песах шени и шабат не читают таханун (в биркат амазон и шма аль амита) в ночь на их исходе

Хасидские даты
10 кислева
19-20 кислева
5 тевета - не все
10 швата - не все
3 тамуза - не все
12-13 тамуза
18 элула - не все
Минха в канун этих дней

Добавить Пурим мешулаш:
Шушан Пурим, выпадающий на шабат, празднуется три дня. В пятницу читают мегилу, в шабат Тору, а в йом ришон - сеуда и остальные заповеди.

Exception - kriat Tora shabat rosh chodesh tevet, shkalim,a-hodesh #98
44 verse=18 7. Бемидбар, 28:9-15 Может ли быть другая глава?
Аналогично - в шабат Шкалим и шабат а-Ходеш, выпавшие в рош ходеш:
на 6 алию читают 6 и 7.
7 алия - чтение см. выше

*/
object Reading {

}
