package org.podval.calendar.generate.chumash

/*
Дополнительные дни чтения Торы

1. Йом тов и холь а-моэд
2. Рош ходеш - 1 и 30 день месяца
3. Ханука - с 25 кислева 8 дней, то есть до 2 или 3 тевета в зависимости от года
4. Пурим 14 адара ( или адара 2 в високосном году) во всем мире, 15 адара (адара 2) в Иерусалиме, сомнительные ( выяснить)
5. Посты: 3 тишрей, 10 тевета, 13 адара (адара 2) - если выпадает на шабат или пятницу - в предыдущий четверг), 17 тамуза ( если шабат - 18), 9 ава ( если шабат - 10)
6. Каждый понедельник и четверг
7. Чтение Торы в минху: шабат, Йом кипур, дни постов.
Законы совпадений:
1. 6) отодвигается при любом сожертвоприношения
2. 2) 3) 4) совпадающие с шабатом - дополнительный свиток Торы
3. 2) и 3) дополнительный свиток , то есть если и 2. то три свитка Торы
4. В 7) Йом кипур отодвигает шабат.
Дополнительные чтения Торы - мафтир.
1. Шабат Шкалим
2. Шабат Захор
3. Шабат Пара
4. Шабат а-Ходеш
5. Когда на шабат выпадает рош ходеш или холь амоед (см. 9) - мафтир жертвоприношения.
6. В холь а-моед Песах - мафтир жертвоприношения.
7. Йом тов, Рош а-шана, Йом кипур - мафтир жертвоприношения.


Тексты для дополнительных чтений Торы

Обязательные чтения в течении года
Основное чтение в шахарит
1. Рош ходеш
а) Бемидбар, 28:1-15
б) в Шабат 28:9-15
в) в будни в Хануку 28:11-15
2. Пост: Шмот 32:11-14, 34:1-10
3. Рош ашана, первый день: Берешит, 21:1-34
4. Рош ашана, второй день: Берешит, 22:1-24
5. Йом кипур шахарит: Ваикра, 16:1-34
6. Первый йом тов Суккот (в диаспоре и второй): Ваикра 22:26 - 23:44
7. Шмини ацерет (диаспора): Дварим, 14:22 - 16:17
8. Симхат Тора: Зот а-браха, Берешит, 1:1-2:3, жертвоприношения
9. Ханука: Бемдбар, 7:1 -8:4 . См. распределение по дням
10. Пурим: Шмот, 17:8-16
11. Песах:Шмот,12:21-51
12. Второй день Песаха       Ваикра, 22:26 - 23:44
13.Седьмой день Песаха:  Шмот, 13:17 - 15:26
14. Последний день Песаха (диаспора) а) если совпал с шабатом Дварим, 14:22 - 16:17
б) если не совпал: Дварим, 15:19 - 16:17
15. Шавуот: Шмот, 19:1 - 20:22
16. Второй день Шавуот (в диаспоре) : Дварим, 14:22 - 16:17
17. Тиша беав: Дварим, 4:25-40
Мафтир
1. Шкалим: Шмот, 30:11-16
2. Захор: Дварим, 25:17-19
3.Пара: Бемидбар, 19:1-22
4. А-ходеш: Шмот, 12:1-20
Основное чтение в минху
1. Йом кипур : Ваикра, 18:1-30
2.  Пост: Шмот, 32:11-14, 34:1-10

Меняющиеся тексты для чтения в зависимости от года
Распределение чтения на холь амоед Песах
1, Шабат хол амоед Суккот и Песах: Шмот, 33:12 - 34:26
2, Кадеш: Шмот, 13:1-16
3,Кесеф: Шмот, 22:24 -23:19
4,Псоль: Шмот, 34:1-26
5, Бемидбар: Бемидбар, 9:1-14
Когда первый день Песаха  в шабат, в первый или третий день недели: с 3 по 6 день Песаха
читают: 2. 3. 4. 5.
Когда первый день Песаха  в пятый день недели: с 3 по 6 день Песаха
читают: 2. 3. 1. 5.

Детальное распределение текстов для чтения в Хануку
Первый день Хануки Бемидбар,7:1-17 (для сфарадим - до 7:23, см. далее).
Чтение следующий шести дней : по минагу ашкеназим (Рамо) и так в Хабаде -
первые двое читают текущий день (пополам), а третий  читает следующий день;
обычай сфарадим - третий возвращается и читает весь текущий день.
2. 18-23
3. 24-29
4. 30-35
5. 36-41
6. 42-47
7. 48-53
Зот Ханука - Бемидбар,7:54 - 89

Тексты жертвоприношений
Все дни жертвоприношений в Храме (кроме шабата, не совпавшего с рош ходеш) мы читаем стихи жертвоприношений (Бемидбар, 28-29)
Эти дни: рош ходеш, Рош ашана, Йом кипур, все праздничные у полупраздничные дни.
В диаспоре обязательное чтение в холь-амоед - двух дней, сегодняшнего и завтрашнего
Из них: в рош-ходеш и холь амоед Суккот жертвоприношения читают в основном чтении. При обязательное чтение должно быть завершением.
В остальные дни  - мафтир.
Рош ходеш - см. выше
Рош-шана, оба дня: Бемидбар, 27:1-6
Йом кипур - 7-11
Суккот первый день(в диаспоре - 2 дня) 12-16
2. 17-19
3. 20-22
4.23-25
5. 26-28
6. 29-31
7. 32-34
В будни холь амоеда -
В Земле Израиля первый читает сегодняшнее, второй - завтрашнее, третий - послезавтрашнее, четвертый  сегодняшнее.
В диаспоре -  первый - вчерашнее, второй - сегодняшее, третий - завтрашнее, четвертый-  вчерашнее и сегодняшнее.
Исключение - 6 день Суккот. Все читают первые три алийот как в диаспоре, но в четвертой - разница как описана выше.
Шмини ацерет ( и Симхат Тора) - 35-39
В Песах первый день ( в диаспоре и второй) Бемидбар, 28:16-25
Со второго по шестой день: 19-25
Седьмой ( и восьмой в диаспоре) день Песаха: 19-25
Шавуот: 26-31

Чтение в шени и хамиши отодвигаются любым обязательным чтением Торы, чтение в минху отодвигается в Йом кипур.

Days without Tachanun
Рош ходеш
Йом тов
Хол- амоэд
Канун Рош ашана
Рош ашана
Канун Йом кипур
Йом кипур
Месяц тишрей с 11 числа
Ханука
Ту бишват
Пурим катан и Шушан Пурим катан
Пурим и Шушан Пурим (Пурим мешулаш также 16 адара)
Весь месяц нисан
Песах шени
Лаг баомер
С 1 до 12 сивана
Тиша беав
Ту биав
Все дни кроме Песах шени, кануна Рош ашана и кануна Йом кипура их канун в минху не говорят таханун.
В Песах шени и шабат не читают таханун (в биркат амазон и шма аль амита) в ночь на их исходе

Хасидские даты
10 кислева
19-20 кислева
5 тевета - не все
10 швата - не все
3 тамуза - не все
12-13 тамуза
18 элула - не все
Минха в канун этих дней

Добавить Пурим мешулаш:
Шушан Пурим, выпадающий на шабат, празднуется три дня. В пятницу читают мегилу, в шабат Тору, а в йом ришон - сеуда и остальные заповеди.

Exception - kriat Tora shabat rosh chodesh tevet, shkalim,a-hodesh #98
44 verse=18 7. Бемидбар, 28:9-15 Может ли быть другая глава?
Аналогично - в шабат Шкалим и шабат а-Ходеш, выпавшие в рош ходеш:
на 6 алию читают 6 и 7.
7 алия - чтение см. выше

*/
object Reading {

}
